;============================================================================;
; RatOS (C) 2022-2023                                                        ;
; Все права защищены                                                         ;
;============================================================================;

; файл actionsKey.asm
; этот код содержит действия клавиш в командной строке

; автор:     xxx_Matvey_xxx и mc_Bagira

; история:   08.01.2023 - дата создания


;============================================================================;
; код                                                                        ;
;============================================================================;

  ;=============================================================================;
  ;  подпрограмма выполняет введенную пользователем команду и переводит         ;
  ;  текстовый курсор на новую строку                                           ;
  ;                                                                             ;
  ;  вход:         нет                                                          ;
  ;                                                                             ;
  ;  выход:        нет                                                          ;
  ;                                                                             ;
  ;  алгоритм:     функция проверяет буфер                                      ;
  ;                                                                             ;
  ;  история:      01.01.2023 - дата создания                                   ;
  ;                                                                             ;
  ;  примечание:                                                                ;
  ;=============================================================================;
  actionKeyEnter:
           ; пишем в буфер команд введенную пользователем команду


           ; выясняем, что за команда и ее параметры

           ;call    getCommandKey

           mov     al, 0xFE

           ; сравниваем коды команд

           cmp     al, 0xFF
           je      unknownCommand

           cmp     al, 0xFE
           je      notEnteredCommand

           cmp     al, 5
           je      actionCM_Run

           cmp     al, commandKeyHello
           je      actionCM_Hello

           cmp     al, commandKeyExit
           je      actionCM_Exit

           cmp     al, commandKeyBell
           je      actionCM_Bell

           cmp     al, commandKeyPrint
           je      actionCM_Print

           cmp     al, commandKeyInfo
           je      actionCM_Info

           cmp     al, commandKeyHelp
           je      actionCM_Help

           ; продолжаем цикл

           jmp     main.wait


 ;---------------------------------------------------------------------------------------
 ;---------------------------------------------------------------------------------------

  ;=============================================================================;
  ;  подпрограмма удаляет последний введенный символ в командной строке         ;
  ;                                                                             ;
  ;  вход:         нет                                                          ;
  ;                                                                             ;
  ;  выход:        нет                                                          ;
  ;                                                                             ;
  ;  алгоритм:                                                                  ;
  ;                                                                             ;
  ;  история:      01.01.2023 - дата создания                                   ;
  ;                                                                             ;
  ;  примечание:                                                                ;
  ;=============================================================================;
  actionKeyBackspace:
           ; проверяем, начало ли строки??

           mov     cx, word [currentX]

           cmp     [lastSymbolBuffer], 0
           je      .exit                         ; если да, то выходим

           ; удаляем последний символ из экрана

           call    subCoordX
           push    cx

           mov     al, ' '                       ; заменяем символ
           mov     ah, lightGray
           call    printB

           ; удаляем последний символ из входного буфера

           dec     [lastSymbolBuffer]

           movzx   bx, [lastSymbolBuffer]
           mov     [bufferKeyboard+bx], 0

           ; перемещаем курсор

           pop     cx
           call    moveCursorPosition

           mov     word [currentX], cx

           .exit:
           jmp     main.wait


 ;---------------------------------------------------------------------------------------
 ;---------------------------------------------------------------------------------------

  ;=============================================================================;
  ;  подпрограмма выводит символ пробела (' ')                                  ;
  ;                                                                             ;
  ;  вход:         нет                                                          ;
  ;                                                                             ;
  ;  выход:        нет                                                          ;
  ;                                                                             ;
  ;  алгоритм:                                                                  ;
  ;                                                                             ;
  ;  история:      01.01.2023 - дата создания                                   ;
  ;                                                                             ;
  ;  примечание:                                                                ;
  ;=============================================================================;
  actionKeySpace:
           ; удаляем последний символ

           mov     al, ' '
           mov     ah, lightGray
           call    printB

           inc     cl
           call    checkXY

           ; перемещаем курсор

           call    moveCursorPosition
           mov     word [currentX], cx

           jmp     main.wait


 ;---------------------------------------------------------------------------------------
 ;---------------------------------------------------------------------------------------

  ;=============================================================================;
  ;  подпрограмма выбирает последнюю команду из списка                          ;
  ;                                                                             ;
  ;  вход:         нет                                                          ;
  ;                                                                             ;
  ;  выход:        нет                                                          ;
  ;                                                                             ;
  ;  алгоритм:                                                                  ;
  ;                                                                             ;
  ;  история:      01.01.2023 - дата создания                                   ;
  ;                                                                             ;
  ;  примечание:                                                                ;
  ;=============================================================================;
  actionKeyArrowLeft:
           ; удаляем последний символ

           dec     [currentX]
           mov     cx, word [currentX]
           call    checkXY

           ; перемещаем курсор

           mov     word [currentX], cx
           call    moveCursorPosition
           jmp     main.wait

 ;---------------------------------------------------------------------------------------
 ;---------------------------------------------------------------------------------------

  ;=============================================================================;
  ;  подпрограмма выбирает последнюю команду из списка                          ;
  ;                                                                             ;
  ;  вход:         нет                                                          ;
  ;                                                                             ;
  ;  выход:        нет                                                          ;
  ;                                                                             ;
  ;  алгоритм:                                                                  ;
  ;                                                                             ;
  ;  история:      01.01.2023 - дата создания                                   ;
  ;                                                                             ;
  ;  примечание:                                                                ;
  ;=============================================================================;
  actionKeyArrowRight:
           ; удаляем последний символ

           inc     [currentX]
           mov     cx, word [currentX]
           call    checkXY

           ; перемещаем курсор

           mov     word [currentX], cx
           call    moveCursorPosition
           jmp     main.wait


  ;=============================================================================;
  ;  подпрограмма выбирает панель инструментов "open"                           ;
  ;                                                                             ;
  ;  вход:         нет                                                          ;
  ;                                                                             ;
  ;  выход:        нет                                                          ;
  ;                                                                             ;
  ;  алгоритм:                                                                  ;
  ;                                                                             ;
  ;  история:      01.01.2023 - дата создания                                   ;
  ;                                                                             ;
  ;  примечание:                                                                ;
  ;=============================================================================;
  actionKeyF1:
           ;
           mov     cx, (1 shl 8) or 2
           mov     bx, 9
           mov     ah, (darkGray shl 4) or white
           call    setAttribytesSymb

           mov     al, 0
           mov     cx, coordToolOpen
           call    drawToolBarMenu

           .wait:
           jmp     .wait

