;============================================================================;
; RatOS (C) 2022-2023                                                        ;
; Все права защищены                                                         ;
;============================================================================;

; файл actionsCommand.asm
; этот код содержит действия команд в командной строке

; автор:     xxx_Matvey_xxx и mc_Bagira

; история:   08.01.2023 - дата создания

;============================================================================;
; определения                                                                ;
;============================================================================;
  ; коды команд пользователя (см. табл. 1.1)

  commandKeyHello        = 0         ; команда HELLO
  commandKeyExit         = 1         ; команда EXIT
  commandKeyBell         = 2         ; команда BELL
  commandKeyPrint        = 3         ; команда PRINT
  commandKeyInfo         = 4         ; команда INFO
  commandKeyHelp         = 6         ; команда HELP


;============================================================================;
; код                                                                        ;
;============================================================================;

  ;=============================================================================;
  ;  функция возвращает код команды                                             ;
  ;                                                                             ;
  ;  вход:         нет                                                          ;
  ;                                                                             ;
  ;  выход:        al - код команды (см. табл. 1.1)                             ;
  ;                                                                             ;
  ;  алгоритм:     функция читает буфер клавиатуры и определяет команду         ;
  ;                                                                             ;
  ;  история:      01.01.2023 - дата создания                                   ;
  ;                                                                             ;
  ;  примечание:   нет                                                          ;
  ;=============================================================================;
  getCommandKey:
           ; запоминаем регистры

           push    cx
           push    dx
           push    di
           push    si

           ; буфер пуст??

           cmp     [lastSymbolBuffer], 0
           je      .notEnteredCommand

           ; адреса

           mov     di, strCommand
           mov     si, bufferKeyboard

           ; подготовка регистров

           xor     cx, cx
           ;mov     bx, 7

           .preLoop:
                   mov     cl, [di]
                   mov     dl, [di+1]

                   add     di, 2
                   mov     [.temp], cx

           ; цикл
           .loop:
                   mov     al, [si]

                   cmp     al, ' '
                   jz      .check

                   push    ax
                   CHECK_azAZ_SHORT al, .cont2, .register

                .cont2:
                   pop     ax

                .cont3:
                   cmpsb       ; сравниваем символы из соответствующих строк
                   jne     .noDone     ; если не равны, то выходим c отрицательным результатом

                   dec      cx
                   jz       .getCode

                   jmp     .loop

           .register:
                   pop     ax

                   and     al, 0xDF
                   mov     [si], al
                   jmp     .cont3

            .temp  dw 0

            .check:
                   mov     al, [di]

                   cmp     al, 0
                   je      .getCode

            .noDone:
                   ;dec     bx
                   ;jz      .unknownCommand

                   add     di, [.temp]
                   dec     di

                   cmp     word [di], 0xFFFF
                   je      .unknownCommand

                   ;cmp     ax, 0
                   ;je      .getCode

                   mov     si, bufferKeyboard
                   jmp     .preLoop

           ; получить код команды
           .getCode:
                   mov     al, dl                 ; передаем код команды
                   jmp     .exit                  ; выходим

           ; команда не введена
           .notEnteredCommand:
                   mov     al, 0xFE
                   jmp     .exit


           ; неизвестная команда
           .unknownCommand:
                   mov     al, 0xFF               ; код неизвестной команды


           ; выход
           .exit:
                   ; восстанавливаем регистры

                   pop     si
                   pop     di
                   pop     dx
                   pop     cx
                   ret


 ;---------------------------------------------------------------------------------------
 ;---------------------------------------------------------------------------------------

  ;=============================================================================;
  ;  процедура пишет на экран сообщение "Hello" на новой строке                 ;
  ;                                                                             ;
  ;  вход:         нет                                                          ;
  ;                                                                             ;
  ;  выход:        нет                                                          ;
  ;                                                                             ;
  ;  алгоритм:     нет                                                          ;
  ;                                                                             ;
  ;  история:      31.12.2022 - дата создания                                   ;
  ;                                                                             ;
  ;  примечание:   нет                                                          ;
  ;=============================================================================;
  actionCM_Hello:
           ; вывод приветствия

           mov     si, msgHello
           mov     ah, lightGreen

           mov     cx, word [currentX]
           call    addCoordY

           mov     cl, 12
           call    print

           ; приготовиться к выполнении другой команды

           inc     [currentY]
           inc     [currentY]
           call    checkXY

           call    clearInputKeyBuffer   ; очищаем входной буфер клавиатуры
           call    printCM               ; выводим сообщение о написании команды

           jmp     main.wait             ; продолжаем главный цикл


 ;---------------------------------------------------------------------------------------
 ;---------------------------------------------------------------------------------------

  ;=============================================================================;
  ;  процедура выполняет выход из приложения/RatOS, если пользователь согласен  ;
  ;                                                                             ;
  ;  вход:         нет                                                          ;
  ;                                                                             ;
  ;  выход:        нет                                                          ;
  ;                                                                             ;
  ;  алгоритм:     нет                                                          ;
  ;                                                                             ;
  ;  история:      31.12.2022 - дата создания                                   ;
  ;                                                                             ;
  ;  примечание:   нет                                                          ;
  ;=============================================================================;
  actionCM_Exit:
           ; вывод приветствия

           mov     si, msgContinue
           mov     ah, lightGreen

           mov     cx, word [currentX]
           call    addCoordY

           mov     cl, 12
           call    print

           ; ждем от пользователя нажатия клавиши

           .loop:
                   call    getKeyLoop

                   cmp     [vScancodeKey], 'Y'
                   je      .shutdown

                   cmp     [vScancodeKey], 'N'
                   je      .exit

                   jmp     .loop

           .exit:
                   ; приготовиться к выполнении другой команды

                   inc     [currentY]
                   inc     [currentY]
                   call    checkXY

                   call    clearInputKeyBuffer   ; очищаем входной буфер клавиатуры
                   call    printCM               ; выводим сообщение о написании команды

                   jmp     main.wait             ; продолжаем главный цикл

           .shutdown:
                   ; call shutdownOS
                   ; jc   .err
                   jmp    $


 ;---------------------------------------------------------------------------------------
 ;---------------------------------------------------------------------------------------

  ;=============================================================================;
  ;  процедура выполняет команду BELL                                           ;
  ;                                                                             ;
  ;  вход:         нет                                                          ;
  ;                                                                             ;
  ;  выход:        нет                                                          ;
  ;                                                                             ;
  ;  алгоритм:     нет                                                          ;
  ;                                                                             ;
  ;  история:      31.12.2022 - дата создания                                   ;
  ;                                                                             ;
  ;  примечание:   нет                                                          ;
  ;=============================================================================;
  actionCM_Bell:
           lea     si, [bufferKeyboard+5]
           mov     cx, [si]

           in      al, 0x61
           push    ax

           or      al, 11b
           out     0x61, al

           ; приготовиться к выполнении другой команды

           inc     [currentY]
           inc     [currentY]
           call    checkXY

           call    clearInputKeyBuffer   ; очищаем входной буфер клавиатуры
           call    printCM               ; выводим сообщение о написании команды

           jmp     main.wait             ; продолжаем главный цикл


 ;---------------------------------------------------------------------------------------
 ;---------------------------------------------------------------------------------------

  ;=============================================================================;
  ;  процедура выводит на экран сообщение, введенное пользователем              ;
  ;                                                                             ;
  ;  вход:         нет                                                          ;
  ;                                                                             ;
  ;  выход:        нет                                                          ;
  ;                                                                             ;
  ;  алгоритм:     нет                                                          ;
  ;                                                                             ;
  ;  история:      31.12.2022 - дата создания                                   ;
  ;                                                                             ;
  ;  примечание:   нет                                                          ;
  ;=============================================================================;
  actionCM_Print:
           ; вычисляем адрес сообщения

           lea     si, [bufferKeyboard+6]

           ; выводим сообщение

           mov     ah, lightGreen

           mov     cx, word [currentX]
           call    addCoordY

           mov     cl, 12
           call    print

           inc     ch
           mov     cl, 12
           call    checkXY

           mov     word [currentX], cx

           ; приготовиться к выполнении другой команды

           call    clearInputKeyBuffer   ; очищаем входной буфер клавиатуры
           call    printCM               ; выводим сообщение о написании команды

           jmp     main.wait             ; продолжаем главный цикл


  ;=============================================================================;
  ;  процедура выводит на экран сообщение, введенное пользователем              ;
  ;                                                                             ;
  ;  вход:         нет                                                          ;
  ;                                                                             ;
  ;  выход:        нет                                                          ;
  ;                                                                             ;
  ;  алгоритм:     нет                                                          ;
  ;                                                                             ;
  ;  история:      31.12.2022 - дата создания                                   ;
  ;                                                                             ;
  ;  примечание:   нет                                                          ;
  ;=============================================================================;
  actionCM_Help:
           ; вычисляем адрес сообщения

           lea     si, [bufferKeyboard+5]
           mov     al, [si]

           ;cmp     al, 'L'
           ;je      .long

           ; выводим сообщение

           mov     ah, lightGreen

           mov     cx, word [currentX]
           call    addCoordY

           mov     cl, 12
           mov     si, msgHelpShort
           call    print

           inc     ch
           mov     cl, 12
           call    checkXY

           mov     word [currentX], cx

           ; приготовиться к выполнении другой команды

           call    clearInputKeyBuffer   ; очищаем входной буфер клавиатуры
           call    printCM               ; выводим сообщение о написании команды

           jmp     main.wait             ; продолжаем главный цикл

  ;=============================================================================;
  ;  процедура выводит на экран сообщение, введенное пользователем              ;
  ;                                                                             ;
  ;  вход:         нет                                                          ;
  ;                                                                             ;
  ;  выход:        нет                                                          ;
  ;                                                                             ;
  ;  алгоритм:     нет                                                          ;
  ;                                                                             ;
  ;  история:      31.12.2022 - дата создания                                   ;
  ;                                                                             ;
  ;  примечание:   нет                                                          ;
  ;=============================================================================;
  actionCM_CLRSCR:
           ; вычисляем адрес сообщения

           lea     si, [bufferKeyboard+5]
           mov     al, [si]

           ;cmp     al, 'L'
           ;je      .long

           ; выводим сообщение

           mov     ah, lightGreen

           mov     cx, word [currentX]
           call    addCoordY

           mov     cl, 12
           mov     si, msgHelpShort
           call    print

           inc     ch
           mov     cl, 12
           call    checkXY

           mov     word [currentX], cx

           ; приготовиться к выполнении другой команды

           call    clearInputKeyBuffer   ; очищаем входной буфер клавиатуры
           call    printCM               ; выводим сообщение о написании команды

           jmp     main.wait             ; продолжаем главный цикл


 ;---------------------------------------------------------------------------------------
 ;---------------------------------------------------------------------------------------

  ;=============================================================================;
  ;  процедура выводит информацию                                               ;
  ;                                                                             ;
  ;  вход:         нет                                                          ;
  ;                                                                             ;
  ;  выход:        нет                                                          ;
  ;                                                                             ;
  ;  алгоритм:     нет                                                          ;
  ;                                                                             ;
  ;  история:      31.12.2022 - дата создания                                   ;
  ;                                                                             ;
  ;  примечание:   нет                                                          ;
  ;=============================================================================;
  actionCM_Info:
           ; вычисляем параметр команды

           lea     si, [bufferKeyboard+5]
           mov     di, paramCM_Info

           ; сравниваем параметр
           .loop:
                   mov     dl, [di+1]
                   mov     cx, [di]

                   cmp     cx, 0xFF
                   je      .preWait

                   inc     di
                   inc     di

                   rep     cmpsb
                   je      .check

                   inc     di
                   inc     di
                   lea     si, [bufferKeyboard+5]

                   jmp     .loop


           ; приготовиться к выполнении другой команды
           .preWait:

                   call    clearInputKeyBuffer   ; очищаем входной буфер клавиатуры
                   call    printCM               ; выводим сообщение о написании команды

                   jmp     main.wait             ; продолжаем главный цикл


           .check:
                   mov     al, dl

                   cmp     al, 0                  ; OS
                   je      .infoOS

                   cmp     al, 1                  ; VBE
                   je      .infoVBE

                   jmp     main.wait


           ; вывод информации о системе
           .infoOS:
                   mov     si, msgInfoOS
                   mov     ah, lightRed

                   mov     cx, word [currentX]
                   call    addCoordY

                   mov     cl, 12
                   call    print

                   jmp     .preWait             ; продолжаем главный цикл


           ; вывод информации о системе
           .infoVBE:
                   mov     si, msgHello
                   mov     ah, lightRed

                   mov     cx, word [currentX]
                   call    addCoordY

                   mov     cl, 12
                   call    print

                   jmp     .preWait             ; продолжаем главный цикл

 paramCM_Info:
                                     db 2
                                     db 0
                   strInfoOS         db "OS", 0

                                     db 4
                                     db 1
                   strInfoTest       db "TEST", 0
                   times 10 db 0xFF


 actionCM_Run:
           mov     cx, word [currentX]
           inc     ch
           call    checkXY

           mov     si, msgRunEnable
           mov     cx, word [currentX]
           mov     ah, white
           call    print

           jmp     run

  run:
           call    getKeyLoop

           ; клавиши управления??

           cmp     byte [scancodeKey], keyEnter       ; enter??
           je      execute                        ; если да, то выполняем введенную команду

           ; пишем ASCII-коды в экран

           call    printKey
           jmp        $

  execute:

; loop (2; print ("HELLO", white)).
; print ("Hi!", red).

; loop (10; nop);

 ;---------------------------------------------------------------------------------------
 ;---------------------------------------------------------------------------------------

  ;=============================================================================;
  ;  процедура запускает пищалку                                                ;
  ;                                                                             ;
  ;  вход:         es:si - адрес проверяемой строки,                            ;
  ;                ds:di - адрес проверяющей строки,                            ;
  ;                                                                             ;
  ;                cx - размер проверяемой строки (в байтах)                    ;
  ;                                                                             ;
  ;  выход:        установлены результаты команды cmpsb, после проверки строк   ;
  ;                                                                             ;
  ;  алгоритм:     функция проверяет строки командой cmpsb                      ;
  ;                                                                             ;
  ;  история:      31.12.2022 - дата создания                                   ;
  ;                                                                             ;
  ;  примечание:   нет                                                          ;
  ;=============================================================================;
  unknownCommand:
           mov     cx, word [currentX]
           call    addCoordY

           mov     cl, 12
           mov     word [currentX], cx

           mov     si, msgUnknownCommand
           mov     ah, red
           call    print

           ; приготовиться к выполнении другой команды

           inc     [currentY]
           inc     [currentY]
           call    checkXY

           call    clearInputKeyBuffer   ; очищаем входной буфер клавиатуры
           call    printCM               ; выводим сообщение о написании команды

                   and     [systemFlags], 11111110b   ; сбрасываем бит

           jmp     main.wait             ; продолжаем главный цикл

  notEnteredCommand:
           mov     cx, word [currentX]
           call    addCoordY

           mov     cl, 12
           ;mov     word [currentX], cx

           mov     si, msgNotEnteredCommand
           mov     ah, red
           call    print

           ; приготовиться к выполнении другой команды

           inc     [currentY]
           inc     [currentY]
           ;call    checkXY

           mov     cx, word [currentX]

           call    clearInputKeyBuffer   ; очищаем входной буфер клавиатуры
           call    printCM               ; выводим сообщение о написании команды

                   and     [systemFlags], 11111110b   ; сбрасываем бит

           jmp     main.wait             ; продолжаем главный цикл

  notArgCommand:
           mov     cx, word [currentX]
           call    addCoordY

           mov     cl, 12

           mov     si, msgNotArgCommand
           mov     ah, red
           call    print

           ; приготовиться к выполнении другой команды

           inc     [currentY]
           inc     [currentY]
           call    checkXY

           call    clearInputKeyBuffer   ; очищаем входной буфер клавиатуры
           call    printCM               ; выводим сообщение о написании команды

           jmp     main.wait             ; продолжаем главный цикл


;============================================================================;
; строки                                                                     ;
;============================================================================;
  msgCommand          db "Command > ", 0          ; указатель на команду
  msgUnknownCommand   db "Unknown command", 0     ; неизвестная команда
  msgNotEnteredCommand db "Command not entered", 0
  msgNotArgCommand    db "Argument not found", 0  ; аргумент не найден

  msgContinue         db "Continue? Y  N", 0

  msgInfoOS           db "RatOS ALPHA/n",\
                         "Version   :/s/n", 0
  numb                dw msgCommand

  msgInfoVBE          db "DD"


;============================================================================;
; команды                                                                    ;
;============================================================================;
  strCommand:
                        db 4
                        db 5
    strCM_Run           db "RUN", 0

                        db 5
                        db 4
    strCM_Info          db "INFO", 0

                        ;dw (0 shl 8) or 6
                        db 6
                        db 0
    strCM_Hello         db "HELLO", 0               ; команда HELLO

                        ;dw (3 shl 8) or 6
                        db 6
                        db 3
    strCM_Print         db "PRINT", 0             ; команда PRINT

                        ;dw (1 shl 8) or 5
                        db 5
                        db 1
    strCM_Exit          db "EXIT", 0                ; команда EXIT

                        ;dw (2 shl 8) or 5
                        db 5
                        db 2
    strCM_Bell          db "BELL", 0                ; команда BELL

                        db 5
                        db 6
    strCM_Help          db "TEST", 0

    times               6 dw 0xFFFF


;============================================================================;
; ???? "main.asm"                                                            ;
;============================================================================;
  include "%ProjectTEST%\commandLine\actionsCommand.inc"


;============================================================================;
; Таблица 1.1 - коды команд пользователя                                     ;
;============================================================================;

  ;+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
  ;+                                Команды                                +
  ;+-----------------------------------------------------------------------+
  ;+  Команда     |  Описание                                              +
  ;+--------------|--------------------------------------------------------+
  ;+  HELLO       |  команда выводит сообщение пользователю "HELLO!"       +
  ;+--------------|--------------------------------------------------------+
  ;+  EXIT        |  команда выходит из ОС, либо из запущенной программы   +
  ;+--------------|--------------------------------------------------------+
  ;+  BELL (del)  |  команда запускает звук в течение заданного времени в  +
  ;+              |  миллисекундах (del), по умолчанию 200 мс.             +
  ;+--------------|--------------------------------------------------------+
  ;+  HELP (x)    |  команда выводит описание всех команд                  +
  ;+              |  если x=:                                              +
  ;+              |  (l) полное описание                                   +
  ;+              |  (s) краткое описание (по умолчанию)                   +
  ;+--------------|--------------------------------------------------------+
  ;+  DATE        |  команда выводит текущую дату (dd.mm.yyyy)             +
  ;+--------------|--------------------------------------------------------+
  ;+  TIME        |  команда выводит текущее время                         +
  ;+--------------|--------------------------------------------------------+
  ;+  PRINT (msg) |  команда выводит заданное сообщение (в msg)            +
  ;+--------------|--------------------------------------------------------+
  ;+  ENTER       |  команда переходит пользователю в панель инструментов, +
  ;+  (tools)     |  если параметр указан, то переходит в заданный меню    +
  ;+              |  инструмента                                           +
  ;+--------------|--------------------------------------------------------+
  ;+  INFO (param)|  команда выводит заданную информацию,                  +
  ;+              |  (param) = OS, вывод информации о установленной RatOS, +
  ;+              |  (param) = SYSTEM, вывод общей информации о системе,   +
  ;+              |  (param) = CPU, вывод информации о процессоре          +
  ;+--------------|--------------------------------------------------------+
  ;+  GAME001     |  команда запускает пианино-игру                        +
  ;+--------------|--------------------------------------------------------+
  ;+  GAME002     |  команда запускает                                     +
  ;+--------------|--------------------------------------------------------+
  ;+  CLRSCR      |  команда очищает экран с заданным цветом               +
  ;+  (color)     |  (color) = 0, черный
  ;+--------------|--------------------------------------------------------+
  ;+  TEST (x)    |  команда предназначена для внутреннего использования   +
  ;+              |  RatOS,                                                +
  ;+              |  (x) = 0, изменяет глобальный цвет окна в зеленый      +
  ;+              |  (x) = 1, вызывает выключение компьютера               +
  ;+--------------|--------------------------------------------------------+
  ;+  $ или LOOP  |  команда переводит систему в цикл,                     +
  ;+  (x)         |  (x) = 0, бесконечный цикл,                            +
  ;+              |  (x) = >1, цикл в указанных миллисекундах              +
  ;+--------------|--------------------------------------------------------+
  ;+  ADDCM (name)|  команда добавляет команду с заданным именем и просит  +
  ;+              |  пользователя написать ассемблерный код команды (FASM) +
  ;+--------------|--------------------------------------------------------+
  ;+  SETVAR      |  команда изменяет заданное значение заданного          +
  ;+  (name),     |  параметра,  +                                         +
  ;+  (value)     |  (name) = VAR_GLOBAL_COLOUR, изменить цвет командной   +
  ;+              |           строки                                       +
  ;+              |  (name) = VAR_TEST_DEBUG, запускает отладчик           +
  ;+--------------|--------------------------------------------------------+


