;============================================================================;
; RatOS (C) 2022-2023                                                        ;
; Все права защищены                                                         ;
;============================================================================;

; файл disk_intX86.asm
; этот код нужен для поддержки функций дисковой подсистемы

; автор:     xxx_Matvey_xxx и mc_Bagira

; история:   08.01.2023 - дата создания

;============================================================================;
; определения                                                                ;
;============================================================================;

  ; прерывания

  interruptDiskBios     = 0x13            ; номер вектора (прерывания) дисковой подсистемы BIOS'а

  ; функции

  functionResetDisk     = 0               ; функция сбрасывает диск
  functionGetStatusDisk = 1               ; функция получает статус последней дисковой операции

  functionReadSector    = 2               ; функция записывает в ОЗУ содержимое сектора (устаревший режим адресации CHS)
  functionWriteSector   = 3               ; функция записывает в сектор содержимое ОЗУ (устаревший режим адресации CHS)

  functionGetDiskParameters   = 8         ; функция получает параметры диска
  functionInitDiskParameters  = 9         ; функция инициализирует параметры диска

  functionCheckSupportLBA  = 0x41         ; функция проверяет поддержку диска на наличие LBA
  functionReadSectorLBA    = 0x42         ; функция записывает в ОЗУ содержимое сектора (LBA-адресация)
  functionWriteSectorLBA   = 3            ; функция записывает в сектор содержимое ОЗУ (LBA-адресация)


;============================================================================;
; код                                                                        ;
;============================================================================;

  ;===========================================================================;
  ;  Функция записывает в ОЗУ сектор (устаревший режим - CHS)                 ;
  ;                                                                           ;
  ;  вход:         es:bx - адрес буфера,                                      ;
  ;                al - кол-во секторов,                                      ;
  ;                                                                           ;
  ;                cl - номер сектора (в 0—5 битах),                          ;
  ;                     биты 8-9 номера цилиндра (в 6-7 битах),               ;
  ;                                                                           ;
  ;                ch - номер цилиндра (0-7 бит),                             ;
  ;                                                                           ;
  ;                dl - номер диска,                                          ;
  ;                dh - номер головки                                         ;
  ;                                                                           ;
  ;  выход:        флаг cf (0 - нет ошибки, 1 - есть ошибка),                 ;
  ;                                                                           ;
  ;                ah - состояние дисковой подсистемы (см. таблицу 1.2),      ;
  ;                al - количество считанных секторов                         ;
  ;                                                                           ;
  ;  алгоритм:     см. таблицу 1.1, функция номер 2                           ;
  ;                                                                           ;
  ;  история:      01.01.2023 - дата создания                                 ;
  ;                                                                           ;
  ;  примечание:   1) кол-во секторов в al всегда должно начинаться на 1, а   ;
  ;                   не на ноль                                              ;
  ;                2) не сохраняет регистры                                   ;
  ;===========================================================================;
  readSectorCHS:
           ; запускаем прерывание

           mov     ah, functionReadSector
           int     interruptDiskBios

           ; проверяем на ошибку

           jc      bad

           ret


 ;---------------------------------------------------------------------------------------
 ;---------------------------------------------------------------------------------------

  ;=============================================================================;
  ;  функция записывает в ОЗУ сектор (новейший режим - LBA)                     ;
  ;                                                                             ;
  ;  вход:         ds:si - адрес пакета LBA,                                    ;
  ;                dl - номер диска                                             ;
  ;                                                                             ;
  ;  выход:        флаг cf (0 - нет ошибки, 1 - есть ошибка),                   ;
  ;                                                                             ;
  ;                ah - состояние дисковой подсистемы (см. табл. 1.2)           ;
  ;                                                                             ;
  ;  алгоритм:     функция использует прерывание дисковой подсистемы BIOS'а —   ;
  ;                0x13, параметр 0x42 (расширенное чтение). Чтобы отправить    ;
  ;                информацию о чтении сектора нужен LBA-пакет.                 ;
  ;                                                                             ;
  ;  история:      01.01.2023 - дата создания                                   ;
  ;                                                                             ;
  ;  примечание:   1) перед использованием функции нужно проверить о поддержке  ;
  ;                   LBA в системе                                             ;
  ;                2) не сохраняет регистры                                     ;
  ;=============================================================================;
  readSectorLBA:
           ; запускаем прерывание

           mov     ah, functionReadSectorLBA
           int     interruptDiskBios

           ; проверяем на ошибку

           jc      bad

           ret


;=============================================================================;
; таблица 1.1 - информация о функциях BIOS'а дисковой-подсистемы (номер 0x13) ;
;=============================================================================;

  ;++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
  ;+ 0-вая функция прерывания 0x13 - сбросить диск до нулевой головки       +
  ;+                                                                        +
  ;+ вход:   — dl (номер диска),                                            +
  ;+           ah == 0 (номер функции)                                      +
  ;+                                                                        +
  ;+ выход:  — carry (флаг, = 1 - ошибка,                                   +
  ;+                        = 0 - нет ошибки),                              +
  ;++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

  ;++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
  ;+ 1-ая функция прерывания 0x13 - получить статус последней операции      +
  ;+                                                                        +
  ;+ вход:   — dl (номер диска),                                            +
  ;+           ah == 1 (номер функции)                                      +
  ;+                                                                        +
  ;+ выход:  — carry (флаг, = 1 - ошибка,                                   +
  ;+                        = 0 - нет ошибки),                              +
  ;+           ah (статус операции (см. табл. 1.2 для просмотра кодов       +
  ;+              статусов))                                                +
  ;++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

  ;++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
  ;+ 2-ая функция прерывания 0x13 - чтение секторов CHS                     +
  ;+                                                                        +
  ;+ вход:   — dl (номер диска),                                            +
  ;+           dh (номер головки),                                          +
  ;+                                                                        +
  ;+           ch (номер цилиндра (младшие 8 битов)),                       +
  ;+           cl [биты 0-5] номер сектора (считая с 1-ого),                +
  ;+              [биты 6-7] биты 8-9 номера цилиндра,                      +
  ;+                                                                        +
  ;+           es:bx (адрес для загрузки),                                  +
  ;+                                                                        +
  ;+           al (количество секторов для загрузки),                       +
  ;+           ah == 2 (номер функции)                                      +
  ;+                                                                        +
  ;+ выход:  — carry (флаг, = 1 - ошибка,                                   +
  ;+                        = 0 - нет ошибки),                              +
  ;+                                                                        +
  ;+           al (количество считанных секторов (кроме 0x11))              +
  ;+           ah (статус операции (см. таблицу 1.2))                       +
  ;++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

  ;++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
  ;+ 8-ая функция прерывания 0x13 - получение параметров диска              +
  ;+                                                                        +
  ;+ вход:   — dl (номер диска),                                            +
  ;+           ah == 8 (номер функции)                                      +
  ;+                                                                        +
  ;+ выход:  — carry (флаг, = 1 - ошибка,                                   +
  ;+                        = 0 - нет ошибки),                              +
  ;+                                                                        +
  ;+         — dl (число жёстких дисков                                     +
  ;+                             на первом контроллере),                    +
  ;+                                                                        +
  ;+         — dh (максимальный номер головки),                             +
  ;+         — ch (максимальный номер цилиндра (младшие 8 битов)),          +
  ;+                                                                        +
  ;+         — cl [биты 0-5] максимальный номер сектора,                    +
  ;+              [биты 6-7] биты 8-9 максимального номера цилиндра         +
  ;++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

  ;++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
  ;+ 0x41-ая функция прерывания 0x13 - проверка поддержки LBA               +
  ;+                                                                        +
  ;+ вход:   — bx == 0x55AA (сигнатура),                                    +
  ;+         — ah == 0x41 (номер функции),                                  +
  ;+                                                                        +
  ;+         — dl (номер диска)                                             +
  ;+                                                                        +
  ;+ выход:  — carry (флаг, = 1 - не поддерживается,                        +
  ;+                        = 0 - поддерживается),                          +
  ;+                                                                        +
  ;+         — bx == 0xAA55 (сигнатура),                                    +
  ;+         — ah (номер версии:                                            +
  ;+                     0x01 - 1.x,                                        +
  ;+                     0x20 - 2.0,                                        +
  ;+                     0x21 - 2.1),                                       +
  ;+         — cx [бит 0] = 1: поддержка расширенного доступа к жёсткому    +
  ;+                           диску диску (функции 42h-44h, 47h, 48h)      +
  ;+              [бит 1] = 1: поддержка расширенного управления дисками со +
  ;+                           съёмным носителем (функции 45h, 46h, 48h,    +
  ;+                                                                   49h) +
  ;+              [бит 2] = 1: поддержка EDD (функции 0x48, 0x4E)           +
  ;+              [биты 3-15] == резерв                                     +
  ;++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

  ;++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
  ;+ 0x42-ая функция прерывания 0x13 - чтение секторов LBA                  +
  ;+                                                                        +
  ;+ вход:   — ah == 0x42 (номер функции),                                  +
  ;+                                                                        +
  ;+         — dl (номер диска)                                             +
  ;+         — ds:si (адрес LBA-пакета, см. таблицу 1.3)                    +
  ;+                                                                        +
  ;+ выход:  — carry (флаг, = 1 - ошибка,                                   +
  ;+                        = 0 - нет ошибки),                              +
  ;+                                                                        +
  ;+           ah (статус операции (см. таблицу 1.2))                       +
  ;++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++


;=============================================================================;
; таблица 1.2 - коды состояний дисковой подсистемы (стандартная и             ;
;                                                   расширенная-LBA версии)   ;
;=============================================================================;

  ;++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
  ;+ Код       Значение                                                     +
  ;+------------------------------------------------------------------------+
  ;+ 00        Нет ошибки                                                   +
  ;+------------------------------------------------------------------------+
  ;+ 01        Неизвестная/неверная комманда                                +
  ;+------------------------------------------------------------------------+
  ;+ 02        Не найдена адресная метка                                    +
  ;+------------------------------------------------------------------------+
  ;+ 03        Диск защищён от записи                                       +
  ;+------------------------------------------------------------------------+
  ;+ 04        Не найден сектор                                             +
  ;+------------------------------------------------------------------------+
  ;+ 05        Ошибка при сбросе HDD                                        +
  ;+------------------------------------------------------------------------+
  ;+ 06        Произошла замена дискеты                                     +
  ;+------------------------------------------------------------------------+
  ;+ 07        Ошибка инициализации                                         +
  ;+------------------------------------------------------------------------+
  ;+ 08        Ошибка DMA                                                   +
  ;+------------------------------------------------------------------------+
  ;+ 09        Выход за пределы 64КБ при работе с DMA                       +
  ;+------------------------------------------------------------------------+
  ;+ 0Ah       Плохой сектор                                                +
  ;+------------------------------------------------------------------------+
  ;+ 0Bh       Плохая дорожка                                               +
  ;+------------------------------------------------------------------------+
  ;+ 0Ch       Неправильный номер дорожки (В некоторых BIOS'ах - не         +
  ;+                                         правильный  номер устройства)  +
  ;+------------------------------------------------------------------------+
  ;+ 0Dh       Неправильный номер сектора                                   +
  ;+------------------------------------------------------------------------+
  ;+ 0Eh       Обнаружена адресная метка управляющих данных                 +
  ;+------------------------------------------------------------------------+
  ;+ 0Fh       Ошибка DMA                                                   +
  ;+------------------------------------------------------------------------+
  ;+ 10h       Ошибка данных (неверная контрольная сумма)                   +
  ;+------------------------------------------------------------------------+
  ;+ 11h       Была произведена коррекция данных для устранения ошибки      +
  ;+------------------------------------------------------------------------+
  ;+ 20h       Сбой контроллера                                             +
  ;+------------------------------------------------------------------------+
  ;+ 30h       Неподдерживаемый формат дискеты                              +
  ;+------------------------------------------------------------------------+
  ;+ 31h       Дискета извлечена                                            +
  ;+------------------------------------------------------------------------+
  ;+ 32h       Неподдерживаемый тип дискеты                                 +
  ;+------------------------------------------------------------------------+
  ;+ 40h       Сбой при поиске дорожки                                      +
  ;+------------------------------------------------------------------------+
  ;+ 80h       Ошибка таймаута                                              +
  ;+------------------------------------------------------------------------+
  ;+ AAh       Диск не готов                                                +
  ;+------------------------------------------------------------------------+
  ;+ B0        Диск не заблокирован                                         +
  ;+------------------------------------------------------------------------+
  ;+ B1        Диск заблокирован                                            +
  ;+------------------------------------------------------------------------+
  ;+ B2        Диск не имеет съёмного носителя                              +
  ;+------------------------------------------------------------------------+
  ;+ B3        Диск занят (используется)                                    +
  ;+------------------------------------------------------------------------+
  ;+ B4        Превышено количество блокировок                              +
  ;+------------------------------------------------------------------------+
  ;+ B5        Пропытка извлечения носителя провалилась                     +
  ;+------------------------------------------------------------------------+
  ;+ B6        Диск защищён от чтения                                       +
  ;+------------------------------------------------------------------------+
  ;+ BBh       Несовместимый контроллер или неизвестная ошибка              +
  ;+------------------------------------------------------------------------+
  ;+ CCh       Сбой при записи                                              +
  ;+------------------------------------------------------------------------+
  ;+ E0h       Неопознанная ошибка контроллера                              +
  ;+------------------------------------------------------------------------+
  ;+ FFh       Ошибка при чтении                                            +
  ;++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++


;=============================================================================;
; таблица 1.3 - LBA-пакет                                                     ;
;=============================================================================;

  ;+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
  ;+                          Структура пакета                             +
  ;+-----------------------------------------------------------------------+
  ;+  Смещение  |  Размер  |  Описание                                     +
  ;+------------|----------|-----------------------------------------------+
  ;+  0         |  1 (б)   |  Размер пакета*                               +
  ;+------------|----------|-----------------------------------------------+
  ;+  1         |  1 (б)   |  Зарезервировано                              +
  ;+------------|----------|-----------------------------------------------+
  ;+  2         |  1 (б)   |  Число секторов для чтения (от 0-127)         +
  ;+------------|----------|-----------------------------------------------+
  ;+  3         |  1 (б)   |  Зарезервировано                              +
  ;+------------|----------|-----------------------------------------------+
  ;+  4         |  4 (б)   |  Адрес буфера в виде пары адресов             +
  ;+            |          |                          (сегмент:смещение)** +
  ;+------------|----------|-----------------------------------------------+
  ;+  8         |  8 (б)   |  LBA-сектор для чтения                        +
  ;+------------|----------|-----------------------------------------------+
  ;+  16        |  8 (б)   |  Расширенный (64-битный) адрес буфера         +
  ;+-----------------------------------------------------------------------+
  ;+  *            Не меньше 10h, кроме того БИОС "округляет" это значение +
  ;+               до ближайшего меньшего известного ему значения, таким   +
  ;+               образом не рекомендуется передавать значения, отличные  +
  ;+               от 10h или 18h                                          +
  ;+-----------------------------------------------------------------------+
  ;+  **           Значение FFFFh:FFFFh означает, что используется поле    +
  ;+               расширенного адреса буфера (смещение 16)                +
  ;+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++


;============================================================================;
; LBA-пакет                                                                  ;
;============================================================================;
  packetLBA:   db 0x10             ; размер пакета

               db 0                ; резерв

               db 1                ; количество секторов (0-0x7F)

               db 0                ; резерв

               dd 0:0x7c00         ; адрес буфера (сегмент и смещение)

               dq 0                ; номер сектора
               dq 0                ; расширенный (64-битный) адрес буфера
