;============================================================================;
; RatOS (C) 2022-2023                                                        ;
; Все права защищены                                                         ;
;============================================================================;

; файл video.asm
; этот код нужен для поддержки функций видеоподсистемы

; автор:     xxx_Matvey_xxx и mc_Bagira

; история:   08.01.2023 - дата создания

;============================================================================;
; код                                                                        ;
;============================================================================;

  ;=============================================================================;
  ;  функция получает размер строки и возвращает это значение                   ;
  ;                                                                             ;
  ;  вход:         ds:si - адрес строки                                         ;
  ;                                                                             ;
  ;  выход:        cx - размер строки (в байтах)                                ;
  ;                                                                             ;
  ;  алгоритм:     циклом доходим до конца строки (до нулевого символа)         ;
  ;                                                                             ;
  ;  история:      31.12.2022 - дата создания                                   ;
  ;                                                                             ;
  ;  примечание:   1) нулевой символ в конце тоже считается в размер строки     ;
  ;                2) регистр si указывает на конец строки (на нулевой символ)  ;
  ;=============================================================================;
  getLenString:
           ; запоминаем регистры

           push    ax
           push    si

           ; подготавливаем регистры

           xor     cx, cx             ; очищаем регистр

           ; цикл
           .loop:
                   lodsb              ; считываем символ

                   inc     cx         ; увеличиваем размер строки

                   cmp     al, ASCodeNull  ; конец строки??
                   jz      .exit      ; если да, то выходим

                   jmp     .loop      ; продолжаем цикл

           ; выход
           .exit:
                   ; восстанавливаем регистры

                   pop     si
                   pop     ax
                   ret


 ;---------------------------------------------------------------------------------------
 ;---------------------------------------------------------------------------------------

  ;=============================================================================;
  ;  функция сравнивает две строки до тех пор, покане будут найдены различные   ;
  ;  символы или не будет достигнут конец строки                                ;
  ;                                                                             ;
  ;  вход:         es:si - адрес проверяемой строки,                            ;
  ;                ds:di - адрес проверяющей строки,                            ;
  ;                                                                             ;
  ;                cx - размер проверяемой строки (в байтах)                    ;
  ;                                                                             ;
  ;  выход:        установлены результаты команды cmpsb, после проверки строк   ;
  ;                                                                             ;
  ;  алгоритм:     функция выходит в случаях:                                   ;
  ;                                1) если cx=0;                                ;
  ;                                2) если al=0;                                ;
  ;                                3) если zf=1.                                ;
  ;                                                                             ;
  ;  история:      31.12.2022 - дата создания                                   ;
  ;                                                                             ;
  ;  примечание:   нет                                                          ;
  ;=============================================================================;
  cmpStrings:
           ; запоминаем регистр

           push    bx
           push    cx
           push    dx

           .loop:
                    cmpsb       ; сравниваем символы из соответствующих строк
                    jne     .noDone     ; если не равны, то выходим c отрицательным результатом

                    dec      cx
                    jz       .done

                    jmp     .loop


           ; строки равны
           .done:
                   mov     ax, 0
                   jmp     .exit


           ; строки не равны
           .noDone:
                   mov     ax, 1


           ; выход
           .exit:
                   ; восстанавливаем регистр

                   pop     dx
                   pop     cx
                   pop     bx
                   ret


 ; вход: ax - число HEX, di - буфер
 ; выход: di - число DEC в буфере
 hex2dec:
         xor     cx, cx
         .loop:
                 cmp     ax, 10
                 jl      .preExit

                 xor     dx, dx
                 mov     bx, 10

                 div     bx      ; ax=dx:ax/bx, %=dx

                 push    di
                 add     di, cx

                 mov     [di], dl
                 pop     di

                 inc     cx
                 jmp     .loop

          .preExit:
                 push    di
                 add     di, cx

                 mov     [di], al
                 pop     di

          .exit:
                 ret

 buffer       rb 20

 ;---------------------------------------------------------------------------------------
 ;---------------------------------------------------------------------------------------

  ;=============================================================================;
  ;  функция переводит из HEX-формата в ASCII-понятную цифру (полубайт)         ;
  ;                                                                             ;
  ;  вход:         al - число в HEX-формате (старшие биты очищены)              ;
  ;                                                                             ;
  ;  выход:        al - число в ASCII-формате                                   ;
  ;                                                                             ;
  ;  алгоритм:     1) прибавляем к числу '0', чтобы превратить его в символ     ;
  ;                   ASCII                                                     ;
  ;                2) если символ ASCII больше '9', то прибавляем еще 7         ;
  ;                                                                             ;
  ;  история:      31.12.2022 - дата создания                                   ;
  ;                                                                             ;
  ;  примечание:   нет                                                          ;
  ;=============================================================================;
  hex2asciiHalfByte:
         add     al, '0'                 ; переводим в ASCII-формат

         cmp     al, '9'                 ; 16-ричное число больше '9'??
         jle     .exit                   ; если нет, то выходим без изменения

         add     al, 7                   ; теперь число будет больше '9'

         ; выход
         .exit:
         ret

 ;---------------------------------------------------------------------------------------
 ;---------------------------------------------------------------------------------------

  ;=============================================================================;
  ;  функция переводит из HEX-формата в ASCII-понятную цифру (байт)             ;
  ;                                                                             ;
  ;  вход:         al - число в HEX-формате                                     ;
  ;                                                                             ;
  ;  выход:        bx - число в ASCII-формате                                   ;
  ;                                                                             ;
  ;  алгоритм:     каждый полубайт числа нужно перевести в ASCII-формат с       ;
  ;                помощью функции hex2asciiHalfByte (см. алгоритм функции)     ;
  ;                                                                             ;
  ;  история:      31.12.2022 - дата создания                                   ;
  ;                                                                             ;
  ;  примечание:   нет                                                          ;
  ;=============================================================================;
  hex2asciiByte:
         ; запоминаем регистр

         mov     bx, ax

         ; переводим в ASCII-формат старший полубайт

         and     al, 0xF0                ; очищаем младший полубайт
         shr     al, 4                   ; перемещаем старший полубайт в младший полубайт

         call    hex2asciiHalfByte
         mov     bh, al                  ; сохраняем результат

         ; переводим в ASCII-формат младший полубайт

         mov     al, bl                  ; восстанавливаем регистр

         and     al, 0x0F                ; очищаем старший полубайт
         call    hex2asciiHalfByte

         mov     bl, al
         ret


 ;---------------------------------------------------------------------------------------
 ;---------------------------------------------------------------------------------------

  ;=============================================================================;
  ;  функция переводит из HEX-формата в ASCII-понятную цифру (слово)            ;
  ;                                                                             ;
  ;  вход:         ax - число в HEX-формате                                     ;
  ;                                                                             ;
  ;  выход:        ebx - число в ASCII-формате                                  ;
  ;                                                                             ;
  ;  алгоритм:     каждый полубайт числа нужно перевести в ASCII-формат с       ;
  ;                помощью функции hex2asciiHalfByte (см. алгоритм функции)     ;
  ;                                                                             ;
  ;  история:      31.12.2022 - дата создания                                   ;
  ;                                                                             ;
  ;  примечание:   нет                                                          ;
  ;=============================================================================;
  hex2asciiWord:
         ; запоминаем регистр

         push    ax

         ; переводим старший байт

         and     ax, 0xFF00
         shr     ax, 8

         call    hex2asciiByte

         ; переносим его в старшие байты 32-битного регистра (2 старших байта)

         movzx   ebx, bx
         shl     ebx, 16

         ; восстанавливаем регистр

         pop     ax

         ; переводим младший байт

         and     ax, 0x00FF
         call    hex2asciiByte

         ret

 ; вход: si - строка, di - буфер, cx - размер
 hex2ascii:
         .loop:
         lodsb
         call hex2asciiByte

         mov [di], bx
         inc di

         dec cx
         jz .exit
         jmp .loop
         .exit:
         ret


 ;---------------------------------------------------------------------------------------
 ;---------------------------------------------------------------------------------------

  ; al - символ
  ; выход: ax=1или0
  checkASCII:
         cmp al, 0x20
         jge  .check

      .noDone:
         mov ax, 1

      .exit:
         ret

      .check:
         cmp al, 0x7E
         jg .noDone

         mov ax, 0
         jmp .exit

  ; вход: al - символ
  ; выход: ax=3,2,1или0
  checkAZaz:
         push ax
         CHECK_ASCII al, .cont1, .noASCII

      .cont1:
         pop ax
         cmp al, 'a'
         jge .cont2

         cmp al, 'A'
         jge .cont3

         jmp .noAAZZaazz

      .cont2:
         cmp al, 'z'
         jle .registerLowercase

         jmp .noASCII

      .cont3:
         cmp al, 'Z'
         jle .registerUppercase

         jmp .noASCII

      .noASCII:
         pop ax
         mov ax, 2
         jmp .exit

      .noAAZZaazz:
         mov ax, 3
         jmp .exit

      .registerLowercase:
         mov ax, 1
         jmp .exit

      .registerUppercase:
         xor ax, ax
         jmp .exit

      .exit:
         ret

