;============================================================================;
; RatOS (C) 2022-2023                                                        ;
; Все права защищены                                                         ;
;============================================================================;

; файл other.asm
; этот код нужен для поддержки корректной работы прерываний

; автор:     xxx_Matvey_xxx и mc_Bagira

; история:   08.01.2023 - дата создания

;============================================================================;
; код                                                                        ;
;============================================================================;

  ;=============================================================================;
  ;  функция инициализирует PIC с программными значениями                       ;
  ;                                                                             ;
  ;  вход:         [bp+4] - ICW1 (формат записи приведен в табл. 1.1), *        ;
  ;                [bp+6] - ICW2 (формат записи приведен в табл. 1.1), * **     ;
  ;                [bp+8] - ICW3 (формат записи приведен в табл. 1.1), * ***    ;
  ;                [bp+10] - ICW4 (формат записи приведен в табл. 1.1), *       ;
  ;                                                                             ;
  ;  выход:        нет                                                          ;
  ;                                                                             ;
  ;  алгоритм:     функция инициализирует регистры контроллера последовательно, ;
  ;                от ICW1 до ICW4 (команды для инициализации PIC). Функция     ;
  ;                также в начале отключает внешние прерывания, для корректной  ;
  ;                работы ОС                                                    ;
  ;                                                                             ;
  ;  история:      01.01.2023 - дата создания                                   ;
  ;                                                                             ;
  ;  примечание:   1) все ICWx предоставлены для обоих контроллеров (ведущего   ;
  ;                   и подчиненного)                                           ;
  ;                2) номер вектора должен быть кратным 8                       ;
  ;                3) биты от 2-3 должны быть равны 11b                         ;
  ;=============================================================================;
  initPIC:
           ; запоминаем регистры

           push    bp
           push    ax

           ; блокируем внешние прерывания

           cli

           ; инициализация регистра ICW1

           mov     al, cl                    ; получаем значение из регистра

           out     IOportPIC1RegCommand, al  ; для ведущего контроллера
           out     IOportPIC2RegCommand, al  ; для подчинненого контроллера

           ; инициализация регистра ICW2

           mov     al, ch

           out     IOportPIC1InitController, al

           add     al, 8                         ; вектора IRQ подчинненого контроллера идут сразу после вектор ведущего
           out     IOportPIC2InitController, al

           ; инициализация регистра ICW3

           mov     ax, dx

           out     IOportPIC1InitController, al

           mov     al, ah
           out     IOportPIC2InitController, al

           ; инициализация регистра ICW4

           mov     al, bl

           out     IOportPIC1InitController, al

           and     al, 11111011b                 ; очищаем бит для включения подчиненного контроллера
           out     IOportPIC2InitController, al

           ; восстанавливаем внешние прерывания

           sti

           ; восстанавливаем регистры

           pop     ax
           pop     bp

           ret

  ; определения функции

  ParamStackICW1  equ [bp+4]    ; адрес 1-ого параметра
  ParamStackICW2  equ [bp+6]    ; адрес 2-ого параметра
  ParamStackICW3  equ [bp+8]    ; адрес 3-ого параметра
  ParamStackICW4  equ [bp+10]   ; адрес 4-ого параметра


 ;---------------------------------------------------------------------------------------
 ;---------------------------------------------------------------------------------------

  ;=============================================================================;
  ;  функция изменяет адрес обработчика прерывания в определенном векторе       ;
  ;                                                                             ;
  ;  вход:         es:ax - адрес обработчика прерывания,                        ;
  ;                bx - номер вектора прерывания                                ;
  ;                                                                             ;
  ;  выход:        нет                                                          ;
  ;                                                                             ;
  ;  алгоритм:     в начале ОЗУ находится таблица векторов прерываний (IVT).    ;
  ;                Здесь от 0:0 по 0:0x400 хранится адрес обработчиков          ;
  ;                прерываний для каждого прерывания                            ;
  ;                                                                             ;
  ;  история:      01.01.2023 - дата создания                                   ;
  ;                                                                             ;
  ;  примечание:   работает только в реальном режиме                            ;
  ;=============================================================================;
  setHandlerInterrupt:
           ; запоминаем регистры

           push    bx
           push    ax

           ; блокируем внешние прерывания

           cli

           ; получаем адрес вектора прерывания в IVT

           mov     ax, 4           ; умножаем на 4, так как для описания адреса требуется 4 байта
                                   ; (сегмент и смещение)
           mul     bx
           mov     bx, ax          ; перемещаем адрес в bx

           ; восстанавливаем регистр

           pop     ax

           ; пишем в IVT адрес обработчика прерывания

           push    0               ; IVT находится в нулевом сегменте (в начале ОЗУ)
           pop     ds

           mov     [ds:bx], ax     ; пишем смещение
           mov     [ds:bx+2], es   ; пишем сегмент

           ; разблокируем внешние прерывания

           sti

           ; восстанавливаем регистр

           pop     bx
           ret


;============================================================================;
; файл "other.inc"                                                           ;
;============================================================================;
  include "%ProjectTEST%\include\other.inc"


;============================================================================;
; Таблица 1.1 - формат команд ICWx контроллера PIC                           ;
;============================================================================;

  ;+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
  ;+                             ICW1 команда                              +
  ;+-----------------------------------------------------------------------+
  ;+  Номер бита  |  Описание                                              +
  ;+--------------|--------------------------------------------------------+
  ;+  7-4         |  Эти биты должны быть равны 0001b *                    +
  ;+--------------|--------------------------------------------------------+
  ;+  3           |  (1) работа в режиме срабатывания триггера уровня      +
  ;+              |  (0) работа в режиме срабатывания  по фронту           +
  ;+--------------|--------------------------------------------------------+
  ;+  2           |  (1) интервал адресов CALL равен 4                     +
  ;+              |  (0) интервал адресов CALL равен 8 (обычно в X86)      +
  ;+--------------|--------------------------------------------------------+
  ;+  1           |  (1) только один PIC в системе                         +
  ;+              |  (0) PIC каскадируется с ведомыми PIC, и ICW3 должен   +
  ;+              |      быть отправлен на контроллер                      +
  ;+--------------|--------------------------------------------------------+
  ;+  0           |  (1) PIC ожидает получить ICW4 во время инициализации  +
  ;+              |  (0) PIC не ожидает получить ICW4 во время             +
  ;+              |      инициализации                                     +
  ;+--------------|--------------------------------------------------------+
  ;+  * - 4-ый бит означает инициализация контроллера PIC, биты 7-5        +
  ;+      предназначены не для архитектуре X86 процессоров                 +
  ;+-----------------------------------------------------------------------+

  ;+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
  ;+                             ICW2 команда                              +
  ;+-----------------------------------------------------------------------+
  ;+  Номер бита  |  Описание                                              +
  ;+--------------|--------------------------------------------------------+
  ;+  7-0         |  указывает на вектора прерываний IRQ *                 +
  ;+--------------|--------------------------------------------------------+
  ;+  * - это предназначено только для процессоров с архитектурой X86      +
  ;+-----------------------------------------------------------------------+

  ;+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
  ;+                             ICW3 команда                              +
  ;+-----------------------------------------------------------------------+
  ;+                        Для ведущего контроллера                       +
  ;+-----------------------------------------------------------------------+
  ;+  Номер бита  |  Описание                                              +
  ;+--------------|--------------------------------------------------------+
  ;+  7-0         |  указывает, какой IRQ подключен к подчинненому         +
  ;*              |  контроллеру PIC                                       +
  ;+--------------|--------------------------------------------------------+
  ;+--------------|--------------------------------------------------------+
  ;+                      Для подчиненного контроллера                     +
  ;+-----------------------------------------------------------------------+
  ;+  Номер бита  |  Описание                                              +
  ;+--------------|--------------------------------------------------------+
  ;+  7-3         |  зарезервировано                                       +
  ;+--------------|--------------------------------------------------------+
  ;+  2-0         |  номер IRQ, к которому ведущий PIC подключается *      +
  ;+--------------|--------------------------------------------------------+
  ;+  * - в двоичном представлении                                         +
  ;+-----------------------------------------------------------------------+

  ;+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
  ;+                             ICW4 команда                              +
  ;+-----------------------------------------------------------------------+
  ;+  Номер бита  |  Описание                                              +
  ;+--------------|--------------------------------------------------------+
  ;+  7-5         |  зарезервировано                                       +
  ;+--------------|--------------------------------------------------------+
  ;+  4           |  специальный полностью вложенный режим. Используется в +
  ;+              |  системах с большим количеством каскадных контроллеров +
  ;+--------------|--------------------------------------------------------+
  ;+  3           |  (1) контроллер работает в буферном режиме             +
  ;+--------------|--------------------------------------------------------+
  ;+  2           |  (1) выбирает мастер буфера. Очищается, если буфер     +
  ;+              |      подчиненный *                                     +
  ;+--------------|--------------------------------------------------------+
  ;+  1           |  (1) по последнему импульсу подтверждения прерывания   +
  ;+              |      контроллер автоматически выполняет операцию       +
  ;+              |      окончания прерывания (EOI)                        +
  ;+--------------|--------------------------------------------------------+
  ;+  0           |  (1) контроллер работает в режиме X86                  +
  ;+              |  (0) контроллер работает в режиме MCS-80/86            +
  ;+--------------|--------------------------------------------------------+
  ;+  * - использовать, если 3-ий бит установлен (если контроллер работает +
  ;+      в буферном режиме)                                               +
  ;+-----------------------------------------------------------------------+


;============================================================================;
; Таблица 1.2 - формат команд OCWx контроллера PIC                           ;
;============================================================================;

  ;+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
  ;+                             OCW1 команда                              +
  ;+-----------------------------------------------------------------------+
  ;+  Номер бита  |  Описание                                              +
  ;+--------------|--------------------------------------------------------+
  ;+  7-0         |  представляет значение IMR *, **                       +
  ;+--------------|--------------------------------------------------------+
  ;+  * - формат регистра IMR указан в табл. 1.3                           +
  ;+-----------------------------------------------------------------------+
  ;+  ** - чтобы получить текущее значение OCW1, нужно прочитать IMR       +
  ;+-----------------------------------------------------------------------+

  ;+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
  ;+                           OCW2 команда (EOI)                          +
  ;+-----------------------------------------------------------------------+
  ;+  Номер бита  |  Описание                                              +
  ;+--------------|--------------------------------------------------------+
  ;+  7-5         |  комбинация команд (см. варианты команд в *) **        +
  ;+              |  7-ой бит - вариант вращения                           +
  ;+              |  6-ой бит - выбор                                      +
  ;+              |  5-ый бит - запрос окончания прерывания (EOI)          +
  ;+--------------|--------------------------------------------------------+
  ;+  4-3         |  зарезервировано                                       +
  ;+--------------|--------------------------------------------------------+
  ;+  2-0         |  уровень прерывания, на который должен реагировать     +
  ;+              |  контроллер                                            +
  ;+--------------|--------------------------------------------------------+
  ;+  * - команды:                                                         +
  ;+------------|---------|----------|-------------------------------------+
  ;+  Вращение  |  Выбор  |  Запрос  |  Описание                           +
  ;+------------|---------|----------|-------------------------------------+
  ;+  0         |   0     |    0     |  поворот в автоматическом режиме    +
  ;+            |         |          |  EOI (CLEAR)                        +
  ;+------------|---------|----------|-------------------------------------+
  ;+  0         |   1     |    0     |  неспецифическая команда EOI        +
  ;+------------|---------|----------|-------------------------------------+
  ;+  0         |   0     |    1     |  нет операции (NOP)                 +
  ;+------------|---------|----------|-------------------------------------+
  ;+  0         |   1     |    1     |  специфическая команда EOI          +
  ;+------------|---------|----------|-------------------------------------+
  ;+  1         |   0     |    0     |  поворот в автоматическом режиме    +
  ;+            |         |          |  EOI (SET)                          +
  ;+------------|---------|----------|-------------------------------------+
  ;+  1         |   0     |    1     |  поворот на неспецифический EOI     +
  ;+------------|---------|----------|-------------------------------------+
  ;+  1         |   1     |    0     |  установить приоритетную команду    +
  ;+------------|---------|----------|-------------------------------------+
  ;+  1         |   1     |    1     |  поворот на определенный EOI        +
  ;+------------|---------|----------|-------------------------------------+
  ;+  ** - команды нужны для успешного завершения IRQ и не только          +
  ;+-----------------------------------------------------------------------+


;============================================================================;
; Таблица 1.3 - формат регистра IMR контроллера PIC                           ;
;============================================================================;

  ;+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
  ;+                              Регистр IMR                              +
  ;+-----------------------------------------------------------------------+
  ;+  Номер бита  |  Описание                                              +
  ;+--------------|--------------------------------------------------------+
  ;+  7-0         |  битовая маска IRQ (для каждого бита свой номер IRQ) * +
  ;+--------------|--------------------------------------------------------+
