;============================================================================;
; RatOS (C) 2022-2023                                                        ;
; Все права защищены                                                         ;
;============================================================================;

; файл video.asm
; этот код нужен для поддержки функций видеоподсистемы

; автор:     xxx_Matvey_xxx и mc_Bagira

; история:   08.01.2023 - дата создания

;============================================================================;
; код                                                                        ;
;============================================================================;

  ;=============================================================================;
  ;  функция выводит на экран строки\массивы\символы, заканчивающиеся нулём     ;
  ;  функция поддерживает форматный вывод                                       ;
  ;                                                                             ;
  ;  вход:         cl — x-координата,                                           ;
  ;                ch — y-координата,                                           ;
  ;                                                                             ;
  ;                ds:si - адрес строки,                                        ;
  ;                ah - цвет и атрибуты (см. таблицу 1.3)                       ;
  ;                                                                             ;
  ;  выход:        bx - количество записанных символов                          ;
  ;                                                                             ;
  ;                di - координата относительно видеобуфера, указывающая конец  ;
  ;                строки                                                       ;
  ;                                                                             ;
  ;                cl — x-координата конца строки,                              ;
  ;                ch — y-координата конца строки                               ;
  ;                                                                             ;
  ;  алгоритм:     для записи символа в экран нужно знать организацию видеобу-  ;
  ;                фера определенного видеорежима. По умолчанию в RatOS ус-     ;
  ;                тановлен 3-ий видеорежим — videoTextMode80x25.               ;
  ;                                                                             ;
  ;                организация видеобуфера этого видеорежима показана в         ;
  ;                таблице 1.3.                                                 ;
  ;                                                                             ;
  ;                функция записывает в видеобуфер по четным адресам символ, по ;
  ;                нечетным — атрибуты символа.                                 ;
  ;                                                                             ;
  ;                функция поддерживает форматный вывод строки с помощью симво- ;
  ;                ла '/x', где 'x' параметр форматирования:                    ;
  ;                         \s - один символ,                                   ;
  ;                         \c - строка,                                        ;
  ;                         \d - десятичное число,                              ;
  ;                         \h - шестнатциричное число,                         ;
  ;                         \p - указатель,                                     ;
  ;                         \n - новая строка,                                  ;
  ;                         \b - 1-секундный писк,                              ;
  ;                         \r - вывод значений регистров (общего назначения,   ;
  ;                              флагов, сегментов и управления процессором),   ;
  ;                         \\ - вывод '\'
  ;                         \colors[c] - изменяет цвет символов и фона,
  ;                                                                             ;
  ;  история:      31.12.2022 - дата создания                                   ;
  ;                                                                             ;
  ;  примечание:   нет                                                          ;
  ;=============================================================================;
  print:
           ; запоминаем регистры

           push    es

           ; переводим из координат x, y в координаты относительно видеобуфера

           call    getXYcoordinate

           ; видеобуфер

           push    orgVideoBufferTextModeColour
           pop     es

           ; запоминаем указатель начала строки

           mov     [pointerString], si

           ; запоминаем x-координату

           mov     [.temp], cl

           ; вычисляем конец строки

           push    si                 ; запоминаем регистры
           push    cx                 ; ...

           call    getLenString       ; получаем размер строки

           mov     dx, cx             ; передаем в dx

           pop     cx                 ; восстанавливаем регистры
           pop     si                 ; ...

           ; очищаем количество записанных символов

           xor     bx, bx

           ; цикл
           .loop:
                   lodsb              ; считываем символ

                   cmp     al, ASCodeNull ; конец строки??
                   jz      .exit      ; если да, то выходим

                   cmp     al, '/'    ; форматирование??
                   jz      .format    ; если да, то форматируем текст

                   stosw              ; записываем символ с атрибутом в видеобуфер

                   inc     bx         ; следующий символ
                   call    addCoordX  ; увеличиваем X-координату

                   jmp     .loop      ; продолжаем цикл


           ; форматирование
           .format:
                   lodsb              ; загружаем параметр

                   push    ax
                   CHECK_azAZ_SHORT al, .format.register, .format.cont1

                .format.cont1:
                   pop     ax

                .format.cont2:
                   cmp     al, 'n'    ; новая строка??
                   je      .newLine

                   cmp     al, 's'    ; вывод символа??
                   je      .printB

                   cmp     al, 'x'    ; вывод HEX-числа??
                   je      .printHex

                   cmp     al, 'd'    ; вывод DEC-числа??
                   je      .printDec

                   cmp     al, 'c'    ; вывод строки??
                   je      .printString

                   jmp     .loop      ; продолжаем цикл

                .format.register:
                   pop     ax
                   and     al, 0xDF
                   jmp     .format.cont2

           ; форматирование - новая строка
           .newLine:
                   call    addCoordY       ; увеличиваем Y-координату
                   mov     cl, [.temp]     ; X-координата

                   call    getXYcoordinate ; переводим в координаты относительно видеопамяти
                   jmp     .loop           ; продолжаем цикл


           ; форматирование - вывод однобайтового символа
           .printB:
                   push    bx
                   push    ax



                   pop     ax
                   pop     bx

                   add     dx, 1
                   jmp     .loop           ; продолжаем цикл


           ; форматирование - вывод HEX-числа
           .printHex:
                   push    bx
                   push    si
                   push    ax



                   pop     ax
                   pop     si
                   pop     bx

                   add     dx, 2
                   jmp     .loop           ; продолжаем цикл


           ; форматирование - вывод DEC-числа
           .printDec:
                   push    bx
                   push    si
                   push    ax

                   mov     bx, [pointerString]
                   add     bx, dx

                   push    cx
                   HEX2DEC [bx], .buff
                   HEX2ASCII .buff, .array, 6
                   pop     cx
                   PRINTS .buff, 12, cx, white

                   pop     ax
                   pop     si
                   pop     bx

                   add     dx, 2
                   jmp     .loop           ; продолжаем цикл



           ; форматирование - вывод строки
           .printString:
                   push    bx
                   push    si
                   push    ax
                   push    cx

                   push    [pointerString]
                   push    dx

                   mov     bx, [pointerString]
                   add     bx, dx

                   mov     si, bx
                   call    print

                   pop     dx
                   add     dx, bx

                   pop     [pointerString]

                   pop     cx
                   pop     ax
                   pop     si
                   pop     bx
                   jmp     .loop

           ; выход
           .exit:
                   ; восстанавливаем регистры

                   pop     es
                   ret

 .temp db 0
 .buff rb 10
 .array rb 10
 .flags db 0

 ;---------------------------------------------------------------------------------------
 ;---------------------------------------------------------------------------------------

  ;=============================================================================;
  ;  функция выводит на экран строки\массивы\символы, заканчивающиеся нулём     ;
  ;                                                                             ;
  ;  вход:         cl — x-координата,                                           ;
  ;                ch — y-координата,                                           ;
  ;                                                                             ;
  ;                ds:si - адрес строки,                                        ;
  ;                ah - цвет и атрибуты (см. таблицу 1.3)                       ;
  ;                                                                             ;
  ;  выход:        bx - количество записанных символов                          ;
  ;                                                                             ;
  ;                di - координата относительно видеобуфера, указывающая конец  ;
  ;                строки                                                       ;
  ;                                                                             ;
  ;                cl — x-координата конца строки,                              ;
  ;                ch — y-координата конца строки                               ;
  ;                                                                             ;
  ;  алгоритм:     для записи символа в экран нужно знать организацию видеобу-  ;
  ;                фера определенного видеорежима. По умолчанию в RatOS ус-     ;
  ;                тановлен 3-ий видеорежим — videoTextMode80x25.               ;
  ;                                                                             ;
  ;                организация видеобуфера этого видеорежима показана в         ;
  ;                таблице 1.3.                                                 ;
  ;                                                                             ;
  ;                функция записывает в видеобуфер по четным адресам символ, по ;
  ;                нечетным — атрибуты символа.                                 ;
  ;                                                                             ;
  ;  история:      31.12.2022 - дата создания                                   ;
  ;                                                                             ;
  ;  примечание:   нет                                                          ;
  ;=============================================================================;
  printS:
           ; запоминаем регистры

           push    es

           ; переводим из координат x, y в координаты относительно видеобуфера

           call    getXYcoordinate

           ; видеобуфер

           push    orgVideoBufferTextModeColour
           pop     es

           ; цикл
           .loop:
                   lodsb              ; считываем символ
                   stosw              ; записываем символ с атрибутом в видеобуфер

                   dec     bx         ; следующий символ
                   jz      .exit      ; если да, то выходим

                   call    addCoordX  ; увеличиваем X-координату

                   jmp     .loop      ; продолжаем цикл

           ; выход
           .exit:
                   ; восстанавливаем регистры

                   pop     es
                   ret


 ;---------------------------------------------------------------------------------------
 ;---------------------------------------------------------------------------------------

  ;=============================================================================;
  ;  функция выводит на экран однобайтовое значение                             ;
  ;                                                                             ;
  ;  вход:         cl — x-координата,                                           ;
  ;                ch — y-координата,                                           ;
  ;                                                                             ;
  ;                ah - цвет и атрибуты (см. таблицу 1.3),                      ;
  ;                al - однобайтовое значение                                   ;
  ;                                                                             ;
  ;  выход:        нет                                                          ;
  ;                                                                             ;
  ;  алгоритм:     см. алгоритм вывода символов в функции print (--^)           ;
  ;                                                                             ;
  ;  история:      31.12.2022 - дата создания                                   ;
  ;                                                                             ;
  ;  примечание:   нет                                                          ;
  ;=============================================================================;
  printB:
           ; запоминаем регистры

           push    es

           ; переводим из координат x, y в координаты относительно видеобуфера

           call    getXYcoordinate

           ; видеобуфер

           push    orgVideoBufferTextModeColour
           pop     es

           stosw                      ; записываем символ в экран
           call    addCoordX          ; увеличиваем X-координату

           ; выход
           .exit:
                   ; восстанавливаем регистры

                   pop     es
                   ret


 ;---------------------------------------------------------------------------------------
 ;---------------------------------------------------------------------------------------

  ;=============================================================================;
  ;  функция выводит на экран двубайтовое значение                              ;
  ;                                                                             ;
  ;  вход:         cl — x-координата,                                           ;
  ;                ch — y-координата,                                           ;
  ;                                                                             ;
  ;                ah - цвет и атрибуты (см. таблицу 1.3),                      ;
  ;                bx - двубайтовое значение                                    ;
  ;                                                                             ;
  ;  выход:        нет                                                          ;
  ;                                                                             ;
  ;  алгоритм:     см. алгоритм вывода символов в функции print (--^)           ;
  ;                                                                             ;
  ;  история:      31.12.2022 - дата создания                                   ;
  ;                                                                             ;
  ;  примечание:   нет                                                          ;
  ;=============================================================================;
  printW:
           ; запоминаем регистры

           push    es
           push    ax

           ; переводим из координат x, y в координаты относительно видеобуфера

           call    getXYcoordinate

           ; видеобуфер

           push    orgVideoBufferTextModeColour
           pop     es

           ; выводим старший байт значения

           mov     al, bh             ; старший байт
           stosw                      ; записываем

           ; выводим младший байт значения

           mov     al, bl             ; младший байт
           stosw                      ; записываем

           inc     cl
           call    addCoordX  ; увеличиваем X-координату

           ; выход
           .exit:
                   ; восстанавливаем регистры

                   pop     ax
                   pop     es
                   ret

 ;---------------------------------------------------------------------------------------
 ;---------------------------------------------------------------------------------------

  ;=============================================================================;
  ;  функция устанавливает атрибуты символов в видеобуфер                       ;
  ;                                                                             ;
  ;  вход:         cl — x-координата,                                           ;
  ;                ch — y-координата,                                           ;
  ;                                                                             ;
  ;                ah - атрибут                                                 ;
  ;                                                                             ;
  ;  выход:        нет                                                          ;
  ;                                                                             ;
  ;  алгоритм:                                                                  ;
  ;                                                                             ;
  ;  история:      31.12.2022 - дата создания                                   ;
  ;                                                                             ;
  ;  примечание:                                                                ;
  ;=============================================================================;
  setAttribytesSymb:
           ; запоминаем регистры

           push    es

           ; переводим из координат x, y в координаты относительно видеобуфера

           call    getXYcoordinate

           ; видеобуфер

           push    orgVideoBufferTextModeColour
           pop     es

           ; цикл
           .loop:
                   mov     al, [es:di]

                   cmp     al, 1
                   je      .doLoop

                   mov     [es:di+1], ah

                   dec     bx
                   jz      .exit

                   inc     di
                   inc     di
                   jmp     .loop

           .doLoop:
                   push    ax
                   push    ax
                   pop     dx

                   and     ah, 0xF0
                   and     dh, 0xF0

                   shr     dh, 4
                   or      ah, dh

                   mov     [es:di+1], ah

                   dec     bx
                   jz      .preExit

                   inc     di
                   inc     di

                   pop     ax
                   jmp     .loop

           .preExit:
                   pop     ax

           ; выход
           .exit:
                   ; восстанавливаем регистры

                   pop     es
                   ret


 ;---------------------------------------------------------------------------------------
 ;---------------------------------------------------------------------------------------

  ;=============================================================================;
  ;  функция выводит на экран горизонтальную линию                              ;
  ;                                                                             ;
  ;  вход:         cl — x-координата,                                           ;
  ;                ch — y-координата,                                           ;
  ;                                                                             ;
  ;                bx - размер квадрата,                                        ;
  ;                ah - цвет и атрибуты (см. таблицу 1.3)                       ;
  ;                                                                             ;
  ;  выход:        нет                                                          ;
  ;                                                                             ;
  ;  алгоритм:     функция выводит горизонтальную линию до тех пор, пока размер ;
  ;                линии не будет равен нулю                                    ;
  ;                                                                             ;
  ;  история:      31.12.2022 - дата создания                                   ;
  ;                                                                             ;
  ;  примечание:   координаты x, y вместе с регистром di указывают на конец     ;
  ;                линии                                                        ;
  ;=============================================================================;
  drawSquare:
           ; запоминаем регистры

           push    es

           ; переводим из координат x, y в координаты относительно видеобуфера

           call    getXYcoordinate

           ; видеобуфер

           push    orgVideoBufferTextModeColour
           pop     es

           ; символ заполнения

           mov     al, ASCodeFullSquare
           mov     dx, bx

           ; цикл
           .loop:
                   push    cx
                   push    bx
                   call    drawHorLine

                   pop     bx
                   pop     cx

                   dec     dx
                   jz      .exit

                   call    addCoordY

                   jmp     .loop      ; продолжаем цикл

           ; выход
           .exit:
                   ; восстанавливаем регистры

                   pop     es
                   ret


 ;---------------------------------------------------------------------------------------
 ;---------------------------------------------------------------------------------------

  ;=============================================================================;
  ;  функция выводит на экран горизонтальную линию                              ;
  ;                                                                             ;
  ;  вход:         cl — x-координата,                                           ;
  ;                ch — y-координата,                                           ;
  ;                                                                             ;
  ;                bx - размер ,                                                ;
  ;                dx - размер ,                                                ;
  ;                ah - цвет и атрибуты (см. таблицу 1.3)                       ;
  ;                                                                             ;
  ;  выход:        нет                                                          ;
  ;                                                                             ;
  ;  алгоритм:     функция выводит горизонтальную линию до тех пор, пока размер ;
  ;                линии не будет равен нулю                                    ;
  ;                                                                             ;
  ;  история:      31.12.2022 - дата создания                                   ;
  ;                                                                             ;
  ;  примечание:   координаты x, y вместе с регистром di указывают на конец     ;
  ;                линии                                                        ;
  ;=============================================================================;
  drawRentagle:
           ; запоминаем регистры

           push    es

           ; переводим из координат x, y в координаты относительно видеобуфера

           call    getXYcoordinate

           ; видеобуфер

           push    orgVideoBufferTextModeColour
           pop     es

           ; символ заполнения

           mov     al, 1

           ; цикл
           .loop:
                   push    cx
                   push    bx
                   call    drawHorLine

                   pop     bx
                   pop     cx

                   dec     dx
                   jz      .exit

                   call    addCoordY

                   jmp     .loop      ; продолжаем цикл

           ; выход
           .exit:
                   ; восстанавливаем регистры

                   pop     es
                   ret


 ;---------------------------------------------------------------------------------------
 ;---------------------------------------------------------------------------------------

  ;=============================================================================;
  ;  функция выводит на экран горизонтальную линию                              ;
  ;                                                                             ;
  ;  вход:         cl — x-координата,                                           ;
  ;                ch — y-координата,                                           ;
  ;                                                                             ;
  ;                bx - размер линии,                                           ;
  ;                ah - цвет и атрибуты (см. таблицу 1.3),                      ;
  ;                                                                             ;
  ;                al - ASCII-символ                                            ;
  ;                                                                             ;
  ;  выход:        bx - размер линии                                            ;
  ;                                                                             ;
  ;  алгоритм:     функция выводит горизонтальную линию до тех пор, пока размер ;
  ;                линии не будет равен нулю                                    ;
  ;                                                                             ;
  ;  история:      31.12.2022 - дата создания                                   ;
  ;                                                                             ;
  ;  примечание:   координаты x, y вместе с регистром di указывают на конец     ;
  ;                линии                                                        ;
  ;=============================================================================;
  drawHorLine:
           ; запоминаем регистры

           push    es
           push    dx

           ; переводим из координат x, y в координаты относительно видеобуфера

           call    getXYcoordinate

           ; видеобуфер

           push    orgVideoBufferTextModeColour
           pop     es

           ; символ заполнения

           ;mov     al, 1

           ; цвет фона и символа одинаковы

           push    ax
           pop     dx

           and     ah, 0x0F
           and     dh, 0x0F

           shl     dh, 4
           or      ah, dh

           ; цикл
           .loop:
                   stosw              ; записываем символ с атрибутом в видеобуфер

                   dec     bx         ; следующий символ
                   jz      .exit      ; если конец, то выходим

                   call    addCoordX  ; увеличиваем X-координату

                   jmp     .loop      ; продолжаем цикл

           ; выход
           .exit:
                   ; восстанавливаем регистры

                   pop     dx
                   pop     es
                   ret


 ;---------------------------------------------------------------------------------------
 ;---------------------------------------------------------------------------------------

  ;=============================================================================;
  ;  функция выводит на экран вертикальную линию                                ;
  ;                                                                             ;
  ;  вход:         cl — x-координата,                                           ;
  ;                ch — y-координата,                                           ;
  ;                                                                             ;
  ;                bx - размер линии,                                           ;
  ;                ah - цвет и атрибуты (см. таблицу 1.3),                      ;
  ;                                                                             ;
  ;                al - ASCII-символ                                            ;
  ;                                                                             ;
  ;  выход:        bx - размер линии                                            ;
  ;                                                                             ;
  ;  алгоритм:     функция выводит вертикальную линию до тех пор, пока размер   ;
  ;                линии не будет равен нулю                                    ;
  ;                                                                             ;
  ;  история:      31.12.2022 - дата создания                                   ;
  ;                                                                             ;
  ;  примечание:   координаты x, y вместе с регистром di указывают на конец     ;
  ;                линии                                                        ;
  ;=============================================================================;
  drawVertLine:
           ; запоминаем регистры

           push    es

           ; переводим из координат x, y в координаты относительно видеобуфера

           call    getXYcoordinate

           ; видеобуфер

           push    orgVideoBufferTextModeColour
           pop     es

           ; символ заполнения

           ;mov     al, ASCodeFullSquare

           ; цвет фона и символа одинаковы

           ;push    ax
           ;pop     dx

           ;and     ah, 0x0F
           ;and     dh, 0x0F

           ;shl     dh, 4
           ;or      ah, dh

           ; цикл
           .loop:
                   stosw              ; записываем символ с атрибутом в видеобуфер
                   add     di, 158    ; следующая линия

                   dec     bx         ; следующий символ
                   jz      .exit      ; если конец, то выходим

                   inc     ch         ; увеличиваем y-координату

                   cmp     ch, 25     ; конец экрана??
                   jg      .exit      ; если да, то выходим

                   jmp     .loop      ; продолжаем цикл

           ; выход
           .exit:
                   ; восстанавливаем регистры

                   pop     es
                   ret


 ;---------------------------------------------------------------------------------------
 ;---------------------------------------------------------------------------------------

  ;=============================================================================;
  ;  функция увеличивает Y-координату и проверяет условия                       ;
  ;                                                                             ;
  ;  вход:         cl — x-координата,                                           ;
  ;                ch — y-координата                                            ;
  ;                                                                             ;
  ;  выход:        cl — x-координата,                                           ;
  ;                ch — y-координата                                            ;
  ;                                                                             ;
  ;  алгоритм:     функция увеличивает на единицу Y-координату и проверяет      ;
  ;                условия:                                                     ;
  ;                         1) если X>80, то обнуляем X и увеличиваем Y коорди- ;
  ;                            наты                                             ;
  ;                         2) если Y>25, то обнуляем X и Y координаты          ;
  ;                                                                             ;
  ;  история:      01.01.2023 - дата создания                                   ;
  ;                                                                             ;
  ;  примечание:   нет                                                          ;
  ;=============================================================================;
  addCoordY:
           ; увеличиваем на единицу Y-координату

           inc     ch

           ; проверяем условия

           call    checkXY

           ; выход
           .exit:
                   ret


 ;---------------------------------------------------------------------------------------
 ;---------------------------------------------------------------------------------------

  ;=============================================================================;
  ;  функция увеличивает X-координату и проверяет условия                       ;
  ;                                                                             ;
  ;  вход:         cl — x-координата,                                           ;
  ;                ch — y-координата                                            ;
  ;                                                                             ;
  ;  выход:        cl — x-координата,                                           ;
  ;                ch — y-координата                                            ;
  ;                                                                             ;
  ;  алгоритм:     функция увеличивает на единицу X-координату и проверяет      ;
  ;                условия:                                                     ;
  ;                         1) если X>80, то обнуляем X и увеличиваем Y коорди- ;
  ;                            наты                                             ;
  ;                         2) если Y>25, то обнуляем X и Y координаты          ;
  ;                                                                             ;
  ;  история:      01.01.2023 - дата создания                                   ;
  ;                                                                             ;
  ;  примечание:   нет                                                          ;
  ;=============================================================================;
  addCoordX:
           ; увеличиваем на единицу X-координату

           inc     cl

           ; проверяем условия

           call    checkXY

           ; выход
           .exit:
                   ret


 ;---------------------------------------------------------------------------------------
 ;---------------------------------------------------------------------------------------

  ;=============================================================================;
  ;  функция увеличивает X-координату и проверяет условия                       ;
  ;                                                                             ;
  ;  вход:         cl — x-координата,                                           ;
  ;                ch — y-координата                                            ;
  ;                                                                             ;
  ;  выход:        cl — x-координата,                                           ;
  ;                ch — y-координата                                            ;
  ;                                                                             ;
  ;  алгоритм:     функция увеличивает на единицу X-координату и проверяет      ;
  ;                условия:                                                     ;
  ;                         1) если X>80, то обнуляем X и увеличиваем Y коорди- ;
  ;                            наты                                             ;
  ;                         2) если Y>25, то обнуляем X и Y координаты          ;
  ;                                                                             ;
  ;  история:      01.01.2023 - дата создания                                   ;
  ;                                                                             ;
  ;  примечание:   нет                                                          ;
  ;=============================================================================;
  subCoordX:
           ; увеличиваем на единицу X-координату

           dec     cl

           ; проверяем условия

           cmp     cl, 0xFF
           je      .setValue

           ; выход
           .exit:
                   call    checkXY

                   ret

           .setValue:
                   mov     cl, 79
                   dec     ch

                   jmp     .exit


 ;---------------------------------------------------------------------------------------
 ;---------------------------------------------------------------------------------------

  ;=============================================================================;
  ;  функция проверяет условия над координатами X, Y                            ;
  ;                                                                             ;
  ;  вход:         cl — x-координата,                                           ;
  ;                ch — y-координата                                            ;
  ;                                                                             ;
  ;  выход:        cl — x-координата,                                           ;
  ;                ch — y-координата                                            ;
  ;                                                                             ;
  ;  алгоритм:     функция и проверяет условия:                                 ;
  ;                        1) если X>80, то обнуляем X и увеличиваем Y коорди-  ;
  ;                           наты                                              ;
  ;                        2) если Y>25, то обнуляем X и Y координаты           ;
  ;                                                                             ;
  ;  история:      01.01.2023 - дата создания                                   ;
  ;                                                                             ;
  ;  примечание:   нет                                                          ;
  ;=============================================================================;
  checkXY:
           ; проверяем условия

           cmp     cl, 80    ; X>80??
           jge     .addY     ; если да, то обнуляем X и увеличиваем Y координаты

           cmp     ch, 25    ; Y>25??
           jge     .clearXY  ; если да, то обнуляем X и Y координаты

           ; выход
           .exit:
                   ret

           ; если X>80
           .addY:
                   xor     cl, cl  ; очищаем X
                   inc     ch      ; увеличиваем Y

                   call    checkXY ; проверяем
                   jmp     .exit

           ; если Y>25
           .clearXY:
                   xor     cl, cl  ; очищаем X
                   xor     ch, ch  ; очищаем Y

                   jmp     .exit   ; выходим


 ;---------------------------------------------------------------------------------------
 ;---------------------------------------------------------------------------------------

  ;=============================================================================;
  ;  функция переводит координаты x, y в координаты относительно видеобуфера    ;
  ;                                                                             ;
  ;  вход:         cl - координата x,                                           ;
  ;                ch - координата y                                            ;
  ;                                                                             ;
  ;  выход:        di - координаты относительно видеобуфера                     ;
  ;                                                                             ;
  ;  алгоритм:     функция пользуется формулой: (y * widthScreen + x) * 2,      ;
  ;                                                                             ;
  ;                где x, y — координаты,                                       ;
  ;                widthScreen — ширина экрана (в данном случае 80)             ;
  ;                                                                             ;
  ;  история:      31.12.2022 - дата создания                                   ;
  ;                                                                             ;
  ;  примечание:                                                                ;
  ;=============================================================================;
  getXYcoordinate:
           ; переводим из координат x, y в координаты относительно видеобуфера

           ; алгоритм:
           ; (y * widthScreen + x) * 2,
           ;
           ; где x, y — координаты,
           ;     widthScreen — ширина экрана (в данном случае 80)

           ;  -----> запоминаем регистры

           push    ax
           push    bx
           push    dx

           ; -----> 1) y * widthScreen

           mov     di, 80
           movzx   ax, ch
           mul     di

           ; -----> 2) temp + x

           movzx   bx, cl
           add     ax, bx

           ; -----> 3) temp * 2

           shl     ax, 1

           ;  -----> проверка на чётность

           test    ax, 1
           jnz     .addOdd

           ; выход
           .exit:
                   ; передаем результат функции в di

                   mov     di, ax

                   ; восстанавливаем регистры

                   pop     dx
                   pop     bx
                   pop     ax
                   ret

           ; превращаем нечетное число в четное
           .addOdd:
                   inc     ax         ; просто увеличиваем число

                   jmp     .exit      ; продолжаем код


 ;---------------------------------------------------------------------------------------
 ;---------------------------------------------------------------------------------------

  ;=============================================================================;
  ;  функция переводит координаты относительно видеобуфера в координаты x, y    ;
  ;                                                                             ;
  ;  вход:         ax - координаты относительно видеобуфера,                    ;
  ;                                                                             ;
  ;  выход:        cl - координата x,                                           ;
  ;                ch - координата y                                            ;
  ;                                                                             ;
  ;  алгоритм:     делим координаты относительно видеобуфера,                   ;
  ;                остаток — y-координата, частное — x-координата               ;
  ;                                                                             ;
  ;  история:      31.12.2022 - дата создания                                   ;
  ;                                                                             ;
  ;  примечание:                                                                ;
  ;=============================================================================;
  getOffsetCoordinate:
           ; сохраняем регистры

           push    ax
           push    bx
           push    dx

           ; подготавливаем регистры

           mov     bx, 160            ; делимое
           xor     dx, dx             ; очищаем регистр

           ; делим

           idiv    bx

           ; возвращаем результаты

           mov     cl, dl             ; остаток — x-координата
           mov     ch, al             ; частное — y-координата

           ; восстанавливаем регистры

           pop     dx
           pop     bx
           pop     ax
           ret


 ;---------------------------------------------------------------------------------------
 ;---------------------------------------------------------------------------------------

  ;=============================================================================;
  ;  функция перемещает текстовый курсор по заданным координатам                ;
  ;                                                                             ;
  ;  вход:         cl - координата x,                                           ;
  ;                ch - координата y                                            ;
  ;                                                                             ;
  ;  выход:        нет                                                          ;
  ;                                                                             ;
  ;  алгоритм:     1) переводим координаты x, y в координаты относительно       ;
  ;                   видеобуфера                                               ;
  ;                                                                             ;
  ;                2) используем индексный порт — 0x3D4,  записываем туда       ;
  ;                   индекс — 0xE. Заносим в этом регистре старший байт        ;
  ;                   координат относительно видеобуфера.                       ;
  ;                                                                             ;
  ;                3) заносим в порт 0x3D4 индекс — 0xF. Заносим в этот         ;
  ;                   регистр младший байт координат относительно видеобуфера   ;
  ;                                                                             ;
  ;  история:      31.12.2022 - дата создания                                   ;
  ;                                                                             ;
  ;  примечание:   нет                                                          ;
  ;=============================================================================;
  moveCursorPosition:
           ; запоминаем регистры

           push    ax
           push    cx
           push    dx
           push    di

           ; переводим в координаты относительно видеобуфера

           call    getXYcoordinate
           shr     di, 1

           push    di

           ; записываем старший байт координат

           mov     dx, IOportIndexCRT              ; порт
           mov     al, indexVideoCursorLocLowReg   ; индекс
           out     dx, al                          ; записываем индекс

           inc     dx                              ; следующий порт

           and     di, 0x00FF                      ; обнуляем старший байт
           mov     ax, di                          ; передаем в регистр ax

           out     dx, al                          ; записываем
           pop     di

           ; записываем младший байт координат

           mov     dx, IOportIndexCRT              ; порт
           mov     al, indexVideoCursorLocHighReg  ; индекс
           out     dx, al                          ; записываем индекс

           inc     dx                              ; следующий порт

           and     di, 0xFF00                      ; обнуляем младший байт
           shr     di, 8                           ; перемещаем биты в младший байт

           mov     ax, di                          ; передаем в регистр ax
           out     dx, al                          ; записываем

           ; восстанавливаем регистры

           pop     di
           pop     dx
           pop     cx
           pop     ax
           ret


 ;---------------------------------------------------------------------------------------
 ;---------------------------------------------------------------------------------------

  ;=============================================================================;
  ;  процедура отключает текстовый курсор                                       ;
  ;                                                                             ;
  ;  вход:         нет                                                          ;
  ;                                                                             ;
  ;  выход:        нет                                                          ;
  ;                                                                             ;
  ;  алгоритм:     используем индексный порт — 0x3D4,  записываем туда индекс — ;
  ;                0xA. В этом регистре пятый бит отвечает за включение\отклю-  ;
  ;                чение текствого курсора. Устанавливаем пятый бит, записываем ;
  ;                результат в порт 0x3D5                                       ;
  ;                                                                             ;
  ;  история:      31.12.2022 - дата создания                                   ;
  ;                                                                             ;
  ;  примечание:   нет                                                          ;
  ;=============================================================================;
  disableCursor:
           ; запоминаем регистры

           push    ax
           push    dx

           ; заносим индекс в порт

           mov     dx, IOportIndexCRT
           mov     al, indexVideoCursorStartReg
           out     dx, al

           ; читаем значения регистра

           inc     dx
           in      al, dx

           ; устанавливаем пятый бит

           or      al, 10000b

           ; записываем в порт

           out     dx, al

           ; восстанавливаем регистры

           pop     dx
           pop     ax
           ret


 ;---------------------------------------------------------------------------------------
 ;---------------------------------------------------------------------------------------

  ;=============================================================================;
  ;  процедура включает текстовый курсор                                        ;
  ;                                                                             ;
  ;  вход:         нет                                                          ;
  ;                                                                             ;
  ;  выход:        нет                                                          ;
  ;                                                                             ;
  ;  алгоритм:     используем индексный порт — 0x3D4,  записываем туда индекс — ;
  ;                0xA. В этом регистре пятый бит отвечает за включение\отклю-  ;
  ;                чение текствого курсора. Сбрасываем пятый бит, записываем    ;
  ;                результат в порт 0x3D5                                       ;
  ;                                                                             ;
  ;  история:      31.12.2022 - дата создания                                   ;
  ;                                                                             ;
  ;  примечание:   нет                                                          ;
  ;=============================================================================;
  enableCursor:
           ; запоминаем регистры

           push    ax
           push    dx

           ; заносим индекс в порт

           mov     dx, IOportIndexCRT
           mov     al, indexVideoCursorStartReg
           out     dx, al

           ; читаем значения регистра

           inc     dx
           in      al, dx

           ; сбрасываем пятый бит

           and      al, 0xEF

           ; записываем в порт

           out     dx, al

           ; восстанавливаем регистры

           pop     dx
           pop     ax
           ret


 ;---------------------------------------------------------------------------------------
 ;---------------------------------------------------------------------------------------

  ;=============================================================================;
  ;  функция выводит на экран шапку окна и панель инструментов                  ;
  ;                                                                             ;
  ;  вход:         [globalColor] - глобальный цвет окна (тема, см. табл. 1.4)   ;
  ;                                                                             ;
  ;  выход:        нет                                                          ;
  ;                                                                             ;
  ;  алгоритм:     функция рисует по заданному цвету шапку окна и панель        ;
  ;                инструментов через функцию drawHorLine                       ;
  ;                                                                             ;
  ;  история:      31.12.2022 - дата создания                                   ;
  ;                                                                             ;
  ;  примечание:   нет                                                          ;
  ;=============================================================================;
  drawToolsBar:
           ; запоминаем регистры

           push    ax
           push    bx
           push    cx

           ; рисуем шапку окна

           mov     ah, [globalColor]
           or      ah, 0xF
           mov     bx, 80
           xor     cx, cx
           mov     al, ASCodeFullSquare
           call    drawHorLine

           ; рисуем панель инструментов

           mov     ah, [globalColor]
           mov     bx, 80
           mov     cx, 1 shl 8
           mov     al, ASCodeFullSquare
           call    drawHorLine

           ; восстанавливаем регистры

           pop     cx
           pop     bx
           pop     ax
           ret

  ;=============================================================================;
  ;  функция выводит на экран меню инструмента                                  ;
  ;                                                                             ;
  ;  вход:         al - тип меню:                                               ;
  ;                     0 - open                                                ;
  ;                     1 - exit                                                ;
  ;                                                                             ;
  ;                cl - координата x,                                           ;
  ;                ch - координата y                                            ;
  ;                                                                             ;
  ;  выход:        нет                                                          ;
  ;                                                                             ;
  ;  алгоритм:     функция рисует по заданному цвету шапку окна и панель        ;
  ;                инструментов через функцию drawHorLine                       ;
  ;                                                                             ;
  ;  история:      31.12.2022 - дата создания                                   ;
  ;                                                                             ;
  ;  примечание:   нет                                                          ;
  ;=============================================================================;
  drawToolBarMenu:
           cmp     al, 0
           je      .toolOpen

           cmp     al, 1
           je      .toolOpen

           jmp     .exit

  .toolOpen:
           mov     bx, 20
           mov     dx, 4
           mov     cx, (2 shl 8) or 2
           mov     ah, darkGray
           call    drawRentagle

           ;mov     cx, (2 shl 8) or 2
           ;mov     bx, (18 shl 8) or 3
           ;mov     ah, (darkGray shl 4) or white
           ;call    drawFrame

           mov     si, tabCompilers
           mov     cx, (2 shl 8) or 2
           mov     ah, (darkGray shl 4) or white
           call    print

           jmp     actionToolComp

  .exit:
           jmp     $


  ; bl - по вертикали, bh - по горизонтали
  drawFrame:
           push    cx

           mov     al, 0xDA
           call    printB

           add     cl, bh

           mov     al, 0xBF
           call    printB

           dec     cl
           dec     cl

           sub     cl, bh
           add     ch, bl

           mov     al, 0xC0
           call    printB

           add     cl, bh

           mov     al, 0xD9
           call    printB

           pop     cx

           push    cx
           push    bx

           inc     cl
           ;dec     bh

           mov     al, 0xC4
           xor     bl, bl
           shr     bx, 8
           call    drawHorLine

           pop     bx
           pop     cx

           push    bx
           push    cx

           add     ch, bl
           inc     cl

           mov     al, 0xC4
           xor     bl, bl
           shr     bx, 8
           call    drawHorLine

           pop     cx
           pop     bx

           push    cx
           push    bx

           mov     al, 0xB3
           xor     bh, bh
           inc     ch
           dec     bl
           dec     bl
           call    drawVertLine

           pop     bx
           pop     cx

           mov     al, 0xB3
           xor     bh, bh
           add     cl, bh
           inc     ch
           call    drawVertLine

           ret

 ;---------------------------------------------------------------------------------------
 ;---------------------------------------------------------------------------------------

  ;=============================================================================;
  ;  функция выводит на экран меню программы                                    ;
  ;                                                                             ;
  ;  вход:         [globalColor] - глобальный цвет окна (тема, см. табл. 1.4)   ;
  ;                                                                             ;
  ;  выход:        нет                                                          ;
  ;                                                                             ;
  ;  алгоритм:     функция:                                                     ;
  ;                         1) рисует шапку окна и панель инструментов          ;
  ;                         2) переводит курсор на вывод текста                 ;
  ;                                                                             ;
  ;  история:      31.12.2022 - дата создания                                   ;
  ;                                                                             ;
  ;  примечание:   нет                                                          ;
  ;=============================================================================;
  drawMenu:
           ; 1) рисует шапку окна и панель инструментов

           ; --------> рисуем шапку и панель управления

                       call    drawToolsBar

           ; --------> выводим название программы

                       mov     si, msgNameWindow
                       mov     cx, coordNameProgramm
                       mov     ah, [globalColor]
                       shl     ah, 4
                       or      ah, 0xF0
                       call    print

           ; --------> выводим панель инструментов

                       mov     si, msgToolsBar
                       mov     cx, coordToolsBar
                       movzx   bx, [numberTools]
                       mov     ah, [globalColor]

                       push    ax
                       pop     dx

                       and     ah, 0x0F
                       shl     ah, 4

                       and     dh, 0xF0
                       or      ah, dh

                       ; цикл
                       .loop:
                              push    bx
                              call    print

                              pop     bx

                              dec     bx
                              jz      .exit

                              inc     cl
                              inc     cl

                              jmp     .loop

                       ; выход из цикла
                       .exit:

           ; --------> выводим сообщение пользователю

                       mov     cx, (2 shl 8) or 2
                       mov     ah, lightGray
                       mov     si, msgCommand
                       call    print

           ; 2) переводит курсор на вывод текста

                       call    moveCursorPosition
           ret


 ;---------------------------------------------------------------------------------------
 ;---------------------------------------------------------------------------------------

  ;=============================================================================;
  ;  подпрограмма выводит на экран символы/строки/массивы/переменные с          ;
  ;  форматируещими параметрами                                                 ;
  ;                                                                             ;
  ;  вход:         es:di - координата относительно экрана                       ;
  ;                ah - цвет и атрибуты (см.                                    ;
  ;                                                                             ;
  ;  выход:        нет                                                          ;
  ;                                                                             ;
  ;  алгоритм:     см. алгоритм подпрограммы print                              ;
  ;                + список форматируещих параметров:                           ;
  ;                  \s - один символ,                                          ;
  ;                  \c - строка,                                               ;
  ;                  \dX - десятичное цифра [2],                                ;
  ;                  \hX - шестнатциричное цифра [2],                           ;
  ;                  \p - указатель,                                            ;
  ;                  \n - новая строка,                                         ;
  ;                  \b - 1-секундный писк,                                     ;
  ;                  \r - вывод значений регистров (общего назначения, флагов,  ;
  ;                                         сегментов и управления процессором),;
  ;                  \\ - вывод '\'                                             ;
  ;                                                                             ;
  ;  история:      31.12.2022 - дата создания                                   ;
  ;                                                                             ;
  ;  примечание:   1) после завершения подпрограммы нужно вернуть обратно       ;
  ;                   значения регистров и сегментов                            ;
  ;                                                                             ;
  ;                                                                             ;
  ;                2) "X" указывает размер выводимой информации:                ;
  ;                        'B' - байт (8-бит)                                   ;
  ;                        'W' - слово (16-бит)                                 ;
  ;                        'D' - двойное слово (32-бит)                         ;
  ;                        'Q' - четверное слово (64-бит)                       ;
  ;                                                                             ;
  ;=============================================================================;
  debPrint:
            push    bx
            push    ax
            push    cx
            push    si

            mov     bx, orgVideoBufferTextModeColour        ; сегмент видеопамяти
            mov     es, bx

            mov     [pointerString], si

            ; узнаем размер строки

            ;call    getLenString           ; выход - cl (количество символов)

            ; цикл
            .loop:
                    lodsb                  ; загружаем из строки символ

                    cmp     al, 0          ; если конец строки??
                    jz      .exit          ; если да, то выходим

                    cmp     al, '\'        ; символ форматируещего параметра??
                    je      .form          ; если да, то исполняем форматирование

                    stosw                  ; записываем в видеопамять символ с атрибутом
                    jmp     .loop          ; продолжаем цикл, пока не загрузится нулевой байт

            ; выход
            .exit:

            pop     si
            pop     cx
            pop     ax
            pop     bx

            ret
            ; форматируещий параметр
            .form:
                    lodsb                  ; загружаем параметр

                    ; смотрим, какой параметр и выполняем его

                    cmp     al, 's'        ; вывод символа??
                    je      .printSymb

                    cmp     al, 'c'        ; вывод строки??
                    je      .printString

                    cmp     al, 'n'        ; новая строка??
                    je      .newString

                    ;cmp     al, 'r'        ; вывод регистров??
                    ;je      .printRegister

                    ;cmp     al, '\'        ; вывод '\'??
                    ;je      .printSlash

                    cmp     al, 'h'        ; вывод 16-ричного числа??
                    je      .printHex

                    jmp     .loop          ; переход, если неизвестный параметр
            ; вывод символа
            .printSymb:
                    push    si

                    mov     si, [pointerString]
                    add     si, cx

                    mov     al, [si]
                    stosw

                    inc     cx             ; ссылка на следующий параметр

                    pop     si

                    jmp     .loop
            ; вывод строки (нультимированной)
            .printString:
                    push    bx
                    push    si
                    push    cx

                    mov     si, [pointerString]

                    add     si, cx
                    call    debPrint

                    ;call    getLenString
                    mov     bx, cx

                    pop     cx
                    add     cx, bx

                    pop     si
                    pop     bx

                    jmp     .loop
            ; новая строка
            .newString:
                    push    ax
                    push    cx
                    push    dx
                    push    bx

                    add     di, 160

                    mov     ax, di
                    mov     bx, di
                    mov     cx, 160
                    ;cdq

                .checkDivisibility:
                    div     cx
                    test    dx, dx
                    jnz     .doNewString

                    mov     di, bx

                    pop     bx
                    pop     dx
                    pop     cx
                    pop     ax

                    jmp     .loop
                .doNewString:
                    dec     bx
                    mov     ax, bx
                    mov     cx, 160
                    xor     dx, dx
                    jmp     .checkDivisibility
             ; вывод регистров
             ;.printRegister:
             ;       mov     bx, ax
             ;       mov     ah, 0x0f
             ;       call    printW
             ; вывод '\'
             ;.printSlash:
             ;       mov     al, '\'
             ;       call    printB
             ;       jmp     .loop
             ; вывод 16-ричного числа
             .printHex:
                    push    bx
                    push    si
                    push    ax

                    ;mov     si, hexString
                    ;call    print

                    mov     si, [pointerString]

                    add     si, cx
                    mov     ax, [si]
                    ;call    hex2asciiByte

                    pop     ax
                    ;call    printW

                    add     cx, 2

                    pop     si
                    pop     bx
                    jmp     .loop


;============================================================================;
; переменные                                                                 ;
;============================================================================;
  pointerString   dw 0


;============================================================================;
; файл "video.inc"                                                           ;
;============================================================================;
  include "%ProjectTEST%\include\video.inc"
